const pages = {
    algebra: {
        equations: [
            {
                name: 'Лінійне рівняння з однією змінною',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Рівняння виду ax = b, де a, b - будь-які числа, x - змінна, називають лінійним рівнянням з однією змінною'
                    },
                    {
                        type: 'ol',
                        data: [
                            'ax = b, a != 0; x = a/b',
                            'ax = b, a=0, b != 0; немає розв’язку',
                            'ax = b, a=0, b=0; безліч розв’язків'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Розв’язання задач',
                        data: [
                            'Визначити невідоме',
                            'Скласти коротку умову',
                            'Скласти рівняння',
                            'Розв`язати рівняння',
                            'З’ясувати належність розв’язку всім невідомим',
                            'Написати відповідь'
                        ]
                    }
                ]
            },
            {
                name: 'Тотожно рівні вирази. Тотожність',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Два вирази відповідні значення яких рівні при будь-яких значеннях змінних називають тотожними або тотожно рівними'
                    },
                    {
                        type: 'Означення',
                        content: 'Тотожність - це рівність, яка правильна при будь-яких значеннях змінних'
                    }
                ]
            },
            {
                name: 'Рівняння з двома змінними. Лінійне рівняння з двома змінними',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Розв’язок рівняння з двома змінними - це пара значень змінних, яка перетворює рівняння в правильну рівність'
                    },
                    {
                        type: 'Означення',
                        content: 'Лінійним рівнянням з двома змінними називають рівняння виду ax+by=c, де a, b, c-деякі числа'
                    }
                ]
            },
            {
                name: 'Система рівняння з двома змінними',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Розв’язком системи рівнянь з двома змінними називають пару чисел, яка перетворює кожне рівняння на правильну рівність'
                    },
                    {
                        type: 'paragraph',
                        content: 'Система може мати 1, безліч та 0 розв’язків'
                    },
                    {
                        type: 'ol',
                        name: 'Є 3 способи розв’язування систем лінійних рівнянь з двома змінними',
                        data: [
                            'графічний',
                            'підстановки',
                            'додавання'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Графічний метод',
                        data: [
                            'Будуємо графік рівнянь, що входять до системи',
                            'Знайти координати точки перетину графіків',
                            'Отримана пара чисел - це розв’язок системи'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Метод підстановки',
                        data: [
                            'З першого рівняння системи виражаємо одну з змінних через змінну другу',
                            'Підставимо отриманий вираз замість змінної цієї змінної у друге рівняння системи',
                            'Розв`яжемо утворене рівняння з однією змінною, знайдемо першу змінну',
                            'Знайдемо відповідне значення змінної другої змінної, підставивши значення змінної першої, у вираз знайдений на першому кроці'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Метод додавання',
                        data: [
                            'Приводимо коефіцієнти при одній змінній до протилежних чисел і додаємо почленно ліві й праві частини рівнянь',
                            'Підставимо знайдене значення другої змінної в одне з рівнянь системи і знайдемо першу змінну'
                        ]
                    }
                ]
            },
            {
                name: 'Квадратні рівняння',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Квадратним називається рівняння виду ax2+bx+c=0, де x-змінна, a,b,c-деякі числа, a != 0'
                    },
                    {
                        type: 'paragraph',
                        content: 'a, b, c - коефіцієнти квадратного рівняння'
                    },
                    {
                        type: 'paragraph',
                        content: 'Якщо a = 1, то квадратне рівняння називають зведеним'
                    },
                    {
                        type: 'paragraph',
                        content: 'Якщо хоча б один з коефіцієнтів b або c = 0, то квадратне рівняння називається неповним'
                    }
                ]
            },
            {
                name: 'Формула коренів квадратного рівняння',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Дискримінінтом квадратного рівняння називають вираз b2-4ac'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'ol',
                        name: 'Кількість коренів квадратного рівняння',
                        data: [
                            '../images/...',
                            '../images/...',
                            '../images/...'
                        ]
                    }
                ]
            },
            {
                name: 'Теорема Вієта',
                elements: [
                    {
                        type: 'Теорема',
                        name: 'Теорема (Вієта)',
                        content: 'Якщо зведене квадратне рівняння має два корені, то їх сума дорівнює другому коефіцієнту з протилежним знаком, а добуток третьому коефіцієнту'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Квадратний тричлен',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Квадратним тричленом називається вираз виду ax2+bx+c=0, де x-змінна, a,b,c-деякі числа, a0'
                    },
                    {
                        type: 'Означення',
                        content: 'Коренем квадратного тричлена називається значення змінної, при якому значення квадратного тричлена дорівнює 0'
                    },
                    {
                        type: 'ol',
                        name: 'Розкладання на тричлен',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Біквадратне рівняння',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'ol',
                        name: 'Розв’язання',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images'
                            },
                            {
                                type: 'formula',
                                content: '../images'
                            }
                        ]
                    }
                ]
            }
        ],
        inequalities: [
            {
                name: 'Числові нерівності',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Якщо обидві частини нерівності є числа, то її називають числовою'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Нерівності бувають строгі і нестрогі'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'ol',
                        name: 'Властивості',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Почленне додавання і множення нерівностей',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'formula',
                                name: 'Нерівності з однаковими знаками можна почленно додавати',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                name: 'Нерівності з однаковими знаками можна почленно перемножити, якщо їх ліві та праві частини - додатні числа',
                                content: '../images/...'
                            }
                        ]
                    },
                    {
                        type: 'formula',
                        name: 'Віднімати і ділити почленно не можна',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Нерівності з однією змінною',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Для розв’язання нерівності з однією змінною, ми використовуємо числові проміжки, що включають в себе мінімальне та максимальне значення'
                    },
                    {
                        type: 'fornmula',
                        content:'../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Для розв’язання нерівності з однією змінною, ми використовуємо числові проміжки, що включають в себе мінімальне та максимальне значення'
                    },
                    {
                        type: 'Означення',
                        content: 'Якщо в проміжку наявні квадратні дужки, то значення біля них включено'
                    },
                    {
                        type: 'Означення',
                        content: 'Якщо в проміжку наявні круглі дужки, то значення біля них виключено'
                    }
                ]
            },
            {
                name: 'Системи лінійних нерівностей',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Для розв’язання системи лінійних нерівностей, ми спершу розв’язуємо кожну з нерівностей в ній, а тоді за допомогою схематичного графіку знаходимо проміжок, що задовольняє кожну з них'
                    }
                ]
            },
            {
                name: 'Подвійні нерівності',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Їх можна розв’язувати, як систему нерівностей, попередньо розділившицілу нерівність на дві менші'
                    }
                ]
            },
            {
                name: 'Лінійні нерівності',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'ol',
                        name: 'Для розв’язання квадратних нерівностей за допомогою графіків треба',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Визначити напрям віток'
                            },
                            {
                                type: 'paragraph',
                                content: 'Знайти нулі функції'
                            },
                            {
                                type: 'paragraph',
                                content: 'Схематично побудувати параболу, використовуючи точку перетину з віссю x, якщо є'
                            },
                            {
                                type: 'paragraph',
                                content: 'За графіком визначити проміжки, при яких виконується задана нерівність'
                            }
                        ]
                    }
                ]
            }
        ],
        intervalsNprogressions: [
            {
                name: 'Числові множини',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'N = {1, 2, 3…} - множина натуральних чисел'
                    },
                    {
                        type: 'paragraph',
                        content: 'Z = {0; +-1; +-2; +-3…} - множина цілих чисел'
                    },
                    {
                        type: 'paragraph',
                        content: 'Q - множина раціональних чисел (цілі і дробові; додатні і від’ємні)'
                    },
                    {
                        type: 'paragraph',
                        content: 'Кожне раціональне число можна записати у вигляді нескінченного періодичного десяткового дробу 5,(0)'
                    },
                    {
                        type: 'Означення',
                        content: 'Ірраціональні числа - це числа, які є нескінченними, неперіодичними десятковими дробами'
                    },
                    {
                        type: 'paragraph',
                        content: 'R - всі числа (множина дійсних чисел)'
                    }
                ]
            },
            {
                name: 'Числові послідовності',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        name: 'Послідовність часто задають за допомогою формули n-го члена',
                        content: '../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Послідовність може бути надана за допомогою рекурентної формули - виражає член послідовності через попередні'
                    },
                    {
                        type: 'paragraph',
                        content: 'Послідовності бувають скінченні, нескінченні, зростаючі, спадні та інші'
                    },
                    {
                        type: 'Означення',
                        content: 'Скінченна послідовністю - це послідовність, яка  має скінченне число членів, то її називають'
                    },
                    {
                        type: 'Означення',
                        content: 'Нескінченна послідовністю - це послідовність, яка  має нескінченне число членів, то її називають'
                    },
                    {
                        type: 'Означення',
                        content: 'Зростаюча послідовність - це послідовність, в якій кожен наступний елемент перевищує попередній'
                    },
                    {
                        type: 'Означення',
                        content: 'Спадна послідовність - це послідовність, в якій кожний член, починаючи з другого, менший від попереднього'
                    }
                ]
            },
            {
                name: 'Арифметична прогресія',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Арифметична прогресія - це послідовність, до кожного наступного члена якої, починаючи від другого, додають певне число'
                    },
                    {
                        type: 'paragraph',
                        content: '7;11;15;19;...'
                    },
                    {
                        type: 'paragraph',
                        content: 'd - різниця арифметичної прогресії'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'Властивість',
                        content: 'Кожен член, починаючи з другого, є середнім арифметичним з двома сусідніми або рівновіддаленими від нього членами'
                    },
                    {
                        type: 'formula',
                        name: 'Сума перших n членів арифметичної прогресії',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Геометрична прогресія',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Геометрична прогресія - це послідовність, кожний член якої, починаючи з другого, дорівнює попередньому, домноженому на одне і те саме число, як називається знаменником геометричної прогресії'
                    },
                    {
                        type: 'paragraph',
                        content: '4;12;36;108;...'
                    },
                    {
                        type: 'paragraph',
                        content: 'q - знаменник геометричної прогресії'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'Властивість',
                        content: 'Квадрат кожного член, починаючи з другого, є добутком двох сусідніх або рівновіддаленими від нього членами'
                    },
                    {
                        type: 'formula',
                        name: 'Сума членів геометричної прогресії',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        name: 'Формула складних відсотків',
                        content: '../images/...'
                    },
                    {
                        type: 'Означення',
                        content: 'Прогресія називається нескінченно спадною, якщо |q|<1'
                    },
                    {
                        type: 'formula',
                        name: 'Сума всіх членів',
                        content: '../images/...'
                    }
                ]
            }
        ],
        functions: [
            {
                name: 'Функція',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Функцією називається залежність змінної y від змінної x при якій кожному значенню x відповідає єдине значення y'
                    },
                    {
                        type: 'paragraph',
                        content: 'x - незалежна змінна (аргумент)'
                    },
                    {
                        type: 'paragraph',
                        content: 'y - залежна змінна (функція)'
                    },
                    {
                        type: 'Означення',
                        content: 'Усі значення, який набуває аргумент утворюють область визначень функції'
                    },
                    {
                        type: 'Означення',
                        content: 'Усі значення, яких набуває залежна змінна утворюють область значень функції'
                    },
                    {
                        type: 'Означення',
                        content: 'Нулі функції - це значення x, при яких функція набуває значення 0:f(x)=0'
                    },
                    {
                        type: 'Означення',
                        content: 'Функція називають зростаючою, якщо більшому значенню x відповідає більше значення y'
                    },
                    {
                        type: 'Означення',
                        content: 'Функція називається спадною, якщо більшому значенню x відповідає менше значення y'
                    },
                    {
                        type: 'Означення',
                        content: 'Проміжок знакосталості функції - це проміжок, на якому y набуває значення одного знаку, тобто y>0 або y<0'
                    },
                    {
                        type: 'paragraph',
                        content: 'Для запису єдиного значення функції, використовуємо фігурні дужки {}'
                    },
                    {
                        type: 'ol',
                        name: 'Способи задання функції',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Словесний'
                            },
                            {
                                type: 'paragraph',
                                content: 'Формулою'
                            },
                            {
                                type: 'paragraph',
                                content: 'Таблицею'
                            },
                            {
                                type: 'paragraph',
                                content: 'Графіком'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Лінійна функція',
                elements: [
                    {
                        type: 'Означення',
                        content: 'функцію, яку можна задати формулою y=kx+b, де y k, b - деякі числа, x - аргумент, називають лінійною'
                    },
                    {
                        type: 'paragraph',
                        content: 'Графіком лінійної функції є пряма'
                    },
                    {
                        type: 'paragraph',
                        content: 'Щоб побудувати пряму достатньо мати 2-і точки'
                    }
                ]
            },
            {
                name: 'Пряма пропорційність',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Лінійну функцію, яку задають формулою y=kx, де k0 називають прямою пропорційністю'
                    },
                    {
                        type: 'paragraph',
                        content: 'Графік прямої пропорційності - це пряма, яка проходить через точку O(0;0)'
                    }
                ]
            },
            {
                name: '../images/...',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Функцію, яку можна задати формулою y=k/x, де x - аргумент, k - будь-яке число, k0, називають оберненою пропорційністю'
                    },
                    {
                        type: 'paragraph',
                        content: 'Графік оберненої пропорційності називається гіперболою'
                    },
                    {
                        type: 'paragraph',
                        content: 'Гіпербола складається з двох віток'
                    },
                    {
                        type: 'paragraph',
                        content: 'Якщо k>0, то гіпербола знаходиться в 1 і 3 чвертях'
                    },
                    {
                        type: 'paragraph',
                        content: 'Якщо k<0, то гіпербола знаходиться в 2 і 4 чвертях'
                    }
                ]
            },
            {
                name: '../images/...',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Графік функції y=x2 називається парабола'
                    },
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'парабола має 2 нескінченні вітки, які плавно сходяться в одній точці - в вершині параболи'
                            },
                            {
                                type: 'paragraph',
                                content: 'Графік симетричний відносно осі y'
                            },
                            {
                                type: 'paragraph',
                                content: 'Область визначення - всі значення x'
                            },
                            {
                                type: 'paragraph',
                                content: 'Область значення y>=0'
                            }
                        ]
                    }
                ]
            },
            {
                name: '../images/...',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            }
                        ]
                    }
                ]
            },
            {
                name: '../images/...',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Графік функції y=ax2 можна отримати з графіка функції y=x2, в результаті розтягнення в a разів від осі x, якщо a>1  і стиснення в a разів, якщо 0<a<1'
                    }
                ]
            },
            {
                name: 'Побудова y=f(x)+b та y=f(x+a)',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Графік функції y=f(x)+b можна отримати з графіка функції y=x2, за допомогою паралельного перенесення вздовж осі y, на b вгору, якщо b>0 і на b вниз, якщо b<0'
                            },
                            {
                                type: 'paragraph',
                                content: 'Графік функції y=f(x+a) можна отримати з графіка функції y=x2, за допомогою паралельного перенесення вздовж осі x, на a одиниць вліво, якщо a>0 і на a одиниць вправо, якщо a<0'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Квадратична функція. Її графік і властивості',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'ol',
                        name: 'Побудова графіка квадратичної функції',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Напрям віток a>0 вгору a<0 вниз'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'paragraph',
                                content: 'Таблиця'
                            },
                            {
                                type: 'paragraph',
                                content: 'Побудова графіка'
                            }
                        ]
                    }
                ]
            }
        ],
        operators: [
            {
                name: 'Степінь',
                elements: [
                    {
                        type: 'ul',
                        name: 'Натуральний показник',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'paragraph',
                                content: '3 - основа степеня'
                            },
                            {
                                type: 'paragraph',
                                content: '4 - показник степеня'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Цілий показник',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Властивості',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Раціональні дроби',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Раціональний дріб - це дріб, чисельник і знаменник якого - многочлени'
                    },
                    {
                        type: 'Означення',
                        content: 'Раціональні вирази - це вирази, що це містять квадратного кореня'
                    },
                    {
                        type: 'Означення',
                        content: 'Допустимі значення змінних - це всі значення, при яких вираз має зміст'
                    },
                    {
                        type: 'Властивість',
                        name: 'Основна властивість дробу',
                        content: 'Якщо чисельник і знаменник раціонального дробу помножити і поділити на один і той самий вираз, то отримаємо дріб, який тотожно дорівнює даному'
                    },
                    {
                        type: 'paragraph',
                        content: 'Щоб додати(відняти) дроби з однаковими знаменниками, треба додати(відняти) їх чисельники і залишити той самий знаменник'
                    }, 
                    {
                        type: 'paragraph',
                        content: 'Щоб додати(відняти) дроби з різними знаменниками звести їх до спільного знаменника, а потім виконати додавання (віднімання) дробів з однаковими знаменниками'
                    }
                ]
            },
            {
                name: 'Множення раціональних дробів',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Щоб помножити дріб на дріб, треба помножити чисельник на чисельник, а знаменник — на знаменник, і перший добуток записати в чисельнику, а другий — у знаменнику. Таким чином перемножуються кілька дробів. Якщо можливо, отриманий у результаті дріб скорочують'
                    },
                    {
                        type: 'paragraph',
                        content: 'Для ділення раціональних дробів, ми перевертаємо другий дріб та заміняємо знак ділення на множення'
                    },
                    {
                        type: 'paragraph',
                        content: 'Дробові рівняння: дріб дорівнює 0, якщо чисельник дорівнює 0, а знаменник не дорівнює нулю'
                    }
                ]
            },
            {
                name: 'Квадратний корінь',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Квадратним коренем з числа a називається невід’ємне число, квадрат якого дорівнює a'
                    },
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Винесення множника з-під знаку кореня'
                            },
                            {
                                type: 'paragraph',
                                content: 'Внесення множника під знак кореня'
                            },
                            {
                                type: 'paragraph',
                                content: 'Звільнення від ірраціональності'
                            }
                        ]
                    }
                ]
            }
        ],
        mials: [
            {
                name: 'Одночлен',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Одночлен - це вираз, який є добутком чисел, змінних та їх степенів'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'Означення',
                        content: 'Стандартний вигляд одночлена - це одночлен, який містить тільки один числовий множник (на першому місці) і степені різних змінних'
                    }
                ]
            },
            {
                name: 'Многочлен',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Многочленом називається сума одночленів'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Подібні члени многочлена мають однакові буквенні вирази'
                    },
                    {
                        type: 'Означення',
                        content: 'Многочлен стандартного вигляду - це сума одночленів стандартного вигляду, серед яких немає подібних'
                    },
                    {
                        type: 'Означення',
                        content: 'Степінь многочлена - це найбільший із степенів одночленів, що входять до нього'
                    },
                    {
                        type: 'paragraph',
                        content: 'Щоб помножити одночлен на многочлен потрібно помножити цей одночлен на кожний член многочлена і отримані добутки додати'
                    },
                    {
                        type: 'paragraph',
                        content: 'Щоб помножити многочлен на многочлен, треба кожний член першого многочлена помножити на кожний член другого многочлена і отримані добутки додати'
                    }
                ]
            },
            {
                name: 'Розкладання многочлена на множники',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Розкласти многочлен на множники означає надати даний многочлен у вигляді добутку кількох множників'
                    },
                    {
                        type: 'ol',
                        name: 'Є 3 способи розкладу многочлена на множники',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Винесення спільного множника за дужки'
                            },
                            {
                                type: 'paragraph',
                                content: 'Групування'
                            },
                            {
                                type: 'paragraph',
                                content: 'Формули скороченого множення'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Спосіб групування',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Цим способом користуються, якщо многочлен містить 4, 6 і так далі множників'
                            },
                            {
                                type: 'paragraph',
                                content: 'Многочлен записують у вигляді пар доданків таким чином, щоб із кожної пари можна було винести один і той самий множник. Цей спільний множник можна винести за дужку'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Формули скороченого множення',
                        data: [
                            {
                                type: 'formula',
                                name: 'Різниця квадратів дорівнює добутку різниці та суми цих виразів',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                name: 'Квадрат суми дорівнює квадрат першого виразу додати подвоєний добуток цих виразів додати квадрат другого виразу',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                name: 'Квадрат різниці дорівнює квадрат першого виразу відняти подвоєний добуток цих виразів додати квадрат другого виразу',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                name: 'Сума кубів двох виразів  дорівнює добутку суми цих виразів і неповного квадрата їхньої різниці',
                                content: '../images/...'
                            },
                            {
                                type: 'formula',
                                name: 'Різниця кубів двох виразів дорівнює добутку різниці цих виразів і неповного квадрату їхньої суми',
                                content: '../images/...'
                            }
                        ]
                    }
                ]
            }
        ],
        other: [
            {
                name: 'Стандартний вигляд числа',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Основні правила комбінаторики',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Комбінаторика - це розділ математики, в якому вивчається питання про те, скільки різних комбінацій, утворених за певним правилом, можна скласти із заданих об’єктів'
                    },
                    {
                        type: 'paragraph',
                        content: 'Більшість комбінаторних задач розв’язуються за правилом суми або правилом добутку'
                    },
                    {
                        type: 'paragraph',
                        content: 'Правило суми: якщо елемент A може бути вибраний n способами, а елемент B - k способами, то вибір A або B може бути здійснений m+k способами'
                    },
                    {
                        type: 'paragraph',
                        content: 'Правило добутку: якщо елемент A може бути вибраний n способами, а елемент B - k способами, то вибір A і B може бути здійснений mk способами'
                    }
                ]
            },
            {
                name: 'Класичне означення ймовірності',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Теорія імовірності - це наука про випадковість подій'
                    },
                    {
                        type: 'paragraph',
                        content: 'Випадкова подія може відбутися, а може і не відбутися'
                    },
                    {
                        type: 'paragraph',
                        content: 'Події позначаємо великими буквами латинського алфавіту'
                    },
                    {
                        type: 'ul',
                        name: 'Події бувають',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'вірогідні (100% так)'
                            },
                            {
                                type: 'paragraph',
                                content: 'неможливі (100% ні)'
                            }
                        ]
                    },
                    {
                        type: 'Означення',
                        content: 'Імовірністю випадкової подій A називають відношення n подій, що сприяють появі події A до загальних n подій'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Статистика',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Статистика - це наука про отримання, обробку і аналіз кількісних даних, які характеризують масові явища',
                    },
                    {
                        type: 'Означення',
                        content: 'Вибірка - це сукупність об’єктів, на основі яких проводять дослідження',
                    },
                    {
                        type: 'Означення',
                        content: 'Об’єм вибірки - це кількість елементів у вибірці',
                    },
                    {
                        type: 'Означення',
                        content: 'Мода(Mo) - це число, яке трапляється найчастіше',
                    },
                    {
                        type: 'Означення',
                        content: 'Медіана(Me) - це число, яке поділяє навпіл варіаційний ряд',
                    },
                    {
                        type: 'Означення',
                        content: 'Середнє значення - це середнє арифметичне всіх елементів у вибірці',
                    },
                    {
                        type: 'Означення',
                        content: 'Розмах вибірки - це різниця між крайніми членами варіаційного ряду',
                    },
                    {
                        type: 'ol',
                        name: 'Наочне подання статистичної інформації',
                        data: [
                            {
                                type: 'paragraph',
                                content: 'Гістограма (стовпчаста діаграма)'
                            },
                            {
                                type: 'formula',
                                content: '../images/...'
                            },
                            {
                                type: 'paragraph',
                                content: 'Кругова діаграма'
                            }
                        ]
                    }
                ]
            }
        ]
    },

    geometry: {
        basicElements: [
            {
                name: 'Геометрія. Точка і пряма. Властивості точок і прямих.',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Планіметрія - це розділ геометрії, де вивчаються властивості фігур на площині'
                    },
                    {
                        type: 'Означення',
                        content: 'Промінь - це відрізок, що має початок і не має кінця'
                    },
                    {
                        type: 'Означення',
                        content: 'Доповняльні промені - це два промені, які мають спільний початок і лежать на одній прямій, доповнюючи один одного до прямої'
                    },
                    {
                        type: 'Означення',
                        content: 'Рівні відрізки - це відрізки, які можна сумістити накладанням'
                    },
                    {
                        type: 'paragraph',
                        content: 'Основні фігури на площині - це точка і пряма'
                    },
                    {
                        type: 'Властивість',
                        name: 'Основна властивість прямої',
                        content: 'Через будь-які дві точки можна провести пряму і до того ж тільки одну'
                    },
                    {
                        type: 'Властивість',
                        name: 'Основна властивість довжини відрізка',
                        content: 'Кожний відрізок має певну довжину, більшу від 0. Довжина відрізка дорівнює сумі довжин частин, на які він розбитий будь-якою точкою'
                    },
                ]
            },
            {
                name: 'Кут. Вимірювання кутів',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Кут - це геометрична фігура, яка складається з двох променів, які виходять з однієї точки'
                    },
                    {
                        type: 'Означення',
                        content: 'Розгорнутий кут - це кут сторони якого є доповняльними променями.'
                    },
                    {
                        type: 'Означення',
                        content: 'Бісектриса кута - це промінь, який виходить з вершини кута і ділить цей кут на 2 рівних кути'
                    },
                    {
                        type: 'Означення',
                        content: 'Суміжні кути - це кути, в яких одна сторона в них спільна, а дві інші сторони цих кутів є доповняльними променями'
                    },
                    {
                        type: 'Означення',
                        content: 'Вертикальні кути - це кути, в яких обидві сторони одного кута є продовженням сторін другого.'
                    },
                    {
                        type: 'Властивість',
                        name: 'Основна властивість вимірювання кутів.',
                        content: 'Кожний кут має градусну міру більшу від нуля. Розгорнутий кут = 180°'
                    },
                    {
                        type: 'paragraph',
                        content: 'Градусна міра кута дорівнює сумі градусних мір кутів на які він розбивається будь-яким променем, що проходить між його сторонами.'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема (про суміжні кути)',
                        content: 'Сума сусідніх кутів = 180°'
                    }
                ]
            },
            {
                name: 'Перпендикулярні прямі',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Перпендикулярні прямі - це прямі, що перетинаються під прямим кутом'
                    },
                    {
                        type: 'Означення',
                        content: 'Перпендикулярні відрізки - це відрізки, що лежать на перпендикулярних прямих'
                    }
                ]
            },
            {
                name: 'Паралельні прямі, ознака паралельності прямих',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Паралельні прямі - це прямі, що не перетинаються і лежать в одній площині'   
                    },
                    {
                        type: 'Означення',
                        content: 'Внутрішні різносторонні кути - це кути, які лежать з різних боків від січної с між прямими а і b'
                    },
                    {
                        type: 'Означення',
                        content: 'Внутрішні односторонні кути - кути, які лежать з одного боку від січної с між прямими а і b'
                    },
                    {
                        type: 'Означення',
                        content: 'Відповідні кути - це два кути, які знаходяться в «одному місці» щодо поперечного, але на різних лініях'
                    },
                    {
                        type: 'Аксіома',
                        name: 'Аксіома (паралельності прямих)',
                        content: 'Через точку, яка не лежить на даній прямій проходить тільки одна пряма, паралельна даній'
                    },
                    {
                        type: 'ol',
                        name: 'Теорема (ознака паралельності прямих)',
                        data: [
                            'Якщо внутрішні різносторонні кути, утворені при перетині двох прямих січною, рівні, то прямі паралельні',
                            'Якщо сума внутрішніх односторонніх кутів = 180°, то такі прямі паралельні',
                            'Якщо відповідні кути рівні, то прямі паралельні'
                        ]
                    }
                ]
            }
        ],
        circle: [
            {
                name: 'Коло, круг',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Відрізок, який сполучає точку на колі з його центром називається радіусом (R)'
                    },
                    {
                        type: 'Означення',
                        content: 'Відрізок, який сполучає дві точки кола називається хордою'
                    },
                    {
                        type: 'Означення',
                        content: 'Хорда, яка проходить через центр кола називаються діаметром (D)'
                    },
                    {
                        type: 'Означення',
                        content: 'Пряма, яка має з колом тільки одну спільну точку називається дотичною до кола'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема (властивість дотичної)',
                        content: 'Дотична до кола перпендикулярна до радіуса, який проведений в точку дотику'
                    },
                    {
                        type: 'Властивість',
                        name: 'Властивість діаметра',
                        content: 'Діаметр кола, який перпендикулярний до хорди ділить цю хорду навпіл'
                    },
                    {
                        type: 'Властивість',
                        name: 'Властивість дотичних',
                        content: 'Якщо через одну точку до кола проведено дві дотичні, то відназки, які сполучають дану точку з точками дотику рівні'
                    }
                ]
            },
            {
                name: 'Взаємне розміщення двох кіл',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'ul',
                                name: 'Два кола не перетинаються (є три випадки)',
                                data: [
                                    'Одне коло розміщене поза іншим O1O2 > R1+R2',
                                    'Одне коло розміщене в іншому O1O2 < R1-R2',
                                    'Центри співпадають - концентричні кола'
                                ]
                            },
                            'Кола перетинаються - O1O2 < R1+R2',
                            {
                                type: 'ul',
                                name: 'Кола перетинаються - O1O2 < R1+R2',
                                data: [
                                    'Зовнішній дотик (спільна дотична і кола знаходяться по різні боки від неї)',
                                    'Внутрішній дотик (спільна дотична і кола знаходяться по один бік від неї)'
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Центральні і вписані кути',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Центральний кут -це кут з вершиною в центрі кола'
                    },
                    {
                        type: 'Означення',
                        content: 'Вписаний кут - це кут, вершина якого лежить на колі, а сторони перетинають коло'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема (про вписаний кут)',
                        content: 'Вписаний кут = половину дуги, на яку він спирається',
                        cons: [
                            'Вписані кути, які спираються на одну і ту саму дугу - рівні',
                            'Вписаний кут, який спирається на діаметр (півколо) - прямий'
                        ]
                    }
                ]
            },
            {
                name: 'Довжина кола. Площа круга',
                elements: [
                    {
                        type: 'formula', 
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Довжина дуги кола. Площа сектора',
                elements: [
                    {
                        type: 'formula', 
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Площа сегмента',
                elements: [
                    {
                        type: 'formula', 
                        content: '../images/...'
                    }
                ]
            },
        ],
        triangles: [
            {
                name: 'Трикутник',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Трикутником називається геометрична фігура, що складається з трьох точок (вершин трикутника), які не лежать на одній прямій, і трьох відрізків (сторін трикутника), що попарно сполучають ці точки'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема (про суму кутів трикутника)',
                        content: 'Сума кутів трикутника дорівнює 180°'
                    },
                    {
                        type: 'ol',
                        name: 'Види трикутників за кутами',
                        data: [
                            'гострі (всі кути гострі)',
                            'прямокутні (один кут прямий, а 2 інші - гострі)',
                            'тупокутні (один кут тупий, а 2 інші - гострі)'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Щоб встановити вид трикутника, якщо відомо сторони a, b, c, c - найбільша сторона',
                        data: [
                            'с2> a2+b2 - тупокутній', 
                            'с2= a2+b2 - прямокутний', 
                            'с2< a2+b2 - гострокутній'
                        ]
                    }
                ]
            },
            {
                name: 'Додаткові елементи',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Висота - це перпендикуляр, опущений з вершини трикутника на пряму, яка містить протилежну сторону'
                    },
                    {
                        type: 'Означення',
                        content: 'Медіана - це відрізок, який сполучає вершину трикутника з серединою протилежної сторони'
                    },
                    {
                        type: 'Означення',
                        content: 'Бісектриса - це відрізок, який виходить з вершини трикутника і ділить кут навпіл'
                    },
                    {
                        type: 'Означення',
                        content: 'Середня лінія - це відрізок, який сполучає середини двох його сторін'
                    },
                    {
                        type: 'Означення',
                        content: 'Зовнішній кут трикутника - це кут, суміжний з кутом цього трикутника'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема(властивість середньої лінії трикутника)',
                        content: 'Середня лінія трикутника, яка сполучає середини двох його сторін паралельна третій стороні і дорівнює її половині',
                    },

                    {
                        type: 'Теорема',
                        name: 'Теорема(про зовнішній кут трикутника)',
                        content: 'Зовнішній кут трикутника = сумі двох кутів трикутника, несуміжних з ним',
                    },

                    {
                        type: 'Теорема',
                        name: 'Теорема(про сторони і кути трикутника)',
                        content: 'У трикутнику навпроти найбільшої сторони лежить найбільший кут',
                    }
                ]
            },
            {
                name: 'Рівні трикутники',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Рівні трикутника - це трикутника, в яких всі сторони і кути рівні'
                    },
                    {
                        type: 'ol',
                        name: 'Ознаки рівності трикутників',
                        data: [
                            'Якщо 2 сторони і кут між ними одного трикутника = відповідно двом сторонам і куту між ними 2-го трикутника, то такі трикутники рівні',
                            'Якщо сторона і 2 прилеглі до неї кути одного трикутника відповідно дорівнюють стороні і 2-м прилеглим до неї кутам 2-го трикутника, то такі трикутники рівні',
                            'Якщо 3 сторони одного трикутника відповідно = 3-м сторонам іншого трикутника, то такі трикутники рівні'
                        ]
                    }
                ]
            },
            {
                name: 'Подібні трикутники',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Подібна трикутника - це трикутника, в яких кути відповідно рівні, а сторони одного трикутника пропорційні відповідним сторонам другого трикутника'
                    },
                    {
                        type: 'Лема',
                        name: 'Лема(про подібні трикутники)',
                        content: 'Пряма, яка паралельна стороні даного трикутника відтинає його подібний'
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки подібності трикутників',
                        data: [
                            {
                                name: 'Ознака подібності трикутників за двома кутами',
                                content: 'Якщо два кути одного трикутника дорівнюють двом кутам другого трикутника, то такі трикутники подібні'
                            },
                            {
                                name: 'Ознака подібності трикутника за двома сторонами і кутом між ними',
                                content: 'Якщо дві сторони одного трикутника пропорційні двом сторонам другого трикутника, а кути, утворені цими сторонами рівні, то такі трикутники подібні'
                            },
                            {
                                name: 'Ознака подібності трикутників за трьома сторонами',
                                content: 'Якщо три сторони одного трикутника пропорційні трьом сторонам другого трикутника, то такі трикутники подібні'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Рівнобедрений трикутник',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Рівнобедрений трикутник — трикутник, у якого дві рівні сторони'
                    },
                    {
                        type: 'Означення',
                        content: 'Рівносторонній трикутник — трикутник, у якого всі сторони рівні'
                    },
                    {
                        type: 'Теорема',
                        name: 'про кути рівнобедреного трикутника',
                        content: 'У рівнобедреному трикутнику кути при основі рівні',
                        cons: 'У рівностороннього трикутника всі кути рівні'
                    },
                    {
                        type: 'Теорема',
                        name: 'про бісектрису рівнобедреного трикутника',
                        content: 'У рівнобедреному трикутнику бісектриса, проведена до основи є медіаною і висотою'
                    },
                    {
                        type: 'ol',
                        name: 'Ознаки рівнобедреного трикутника',
                        data: [
                            'Якщо медіана трикутника є його висотою, то цей трикутник рівнобедрений',
                            'Якщо бісектриса трикутника є його висотою, то цей трикутник рівнобедрений',
                            'Якщо медіана трикутника є його бісектрисою, то цей трикутник рівнобедрений',
                            'Якщо в трикутнику 2 кути рівні, то цей трикутник рівнобедрений',
                            'Якщо в трикутнику всі кути рівні, то цей трикутник рівносторонній'
                        ]
                    }
                ]
            },
            {
                name: 'Прямокутний трикутник',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Прямокутним трикутником називають трикутник, один із кутів якого прямий'
                    },
                    {
                        type: 'Означення',
                        content: 'Катет — сторона прямокутного трикутника, прилегла до прямого кута'
                    },
                    {
                        type: 'Означення',
                        content: 'Гіпотенуза — сторона прямокутного трикутника, яка лежить навпроти прямого кута'
                    },
                    {
                        type: 'paragraph',
                        content: 'Розв’язати прямокутний трикутник означає знайти невідомі сторони і кути (всього 5: 2-відомі; 3-невідомі)'
                    },
                    {
                        type: 'ol',
                        name: 'Ознаки рівностей прямокутних трикутників',
                        data: [
                            'Якщо гіпотенуза та катети одного прямокутного трикутника відповідно дорівнюють гіпотенузі та катетам другого прямокутного трикутника, то такі трикутника рівні',
                            'За двома катетами',
                            'За катетом і прилеглим гострим кутом',
                            'За катетом і протилежним гострим кутом',
                            'За гіпотенузою і гострим кутом'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Властивості прямокутних трикутників',
                        data: [
                            'У прямокутному трикутнику гіпотенуза більша за катет',
                            'Перпендикуляр завжди менший від похилої',
                            'Катет, який лежить навпроти кута 30° дорівнює половині гіпотенузи',
                            'Якщо в прямокутному трикутнику катет дорівнює половині гіпотенузи, то кут, який лежить навпроти цього катета дорівнює 30°'
                        ]
                    }
                ],
            },
            {
                name: 'Метричні співвідношення в прямокутному трикутнику',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Висота прямокутного трикутника, проведена до гіпотенузи ділить трикутник на 2 подібних прямокутних трикутника, кожен з яких подібний даному'
                    },
                    {
                        type: 'paragraph',
                        content: 'Квадрат висоти прямокутного трикутника, проведеної до гіпотенузи дорівнює добутку проекцій катетів на гіпотенузу'
                    },
                    {
                        type: 'paragraph',
                        content: 'Квадрат катета дорівнює добутку гіпотенузи та проекції цього катета на гіпотенузу'
                    }
                ]
            },
            {
                name: 'Коло, вписане в трикутник',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Коло називається вписаним у трикутник, якщо воно дотикається до всіх його сторін'
                    },
                    {
                        type: 'paragraph',
                        content: 'У будь-який трикутник можна вписати коло'
                    },
                    {
                        type: 'paragraph',
                        content: 'Центр кола, вписаного в трикутник - це точка перетину бісектрис'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Коло, описане навколо трикутника',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Коло називається описаним навколо трикутника, якщо воно проходить через усі його вершини'
                    },
                    {
                        type: 'paragraph',
                        content: 'Навколо будь-якого трикутника можна описати коло'
                    },
                    {
                        type: 'paragraph',
                        content: 'Центр кола, описаного навколо трикутника - це точка перетину серединних перпендикулярів до сторін трикутника'
                    },
                    {
                        type: 'paragraph',
                        content: 'Центр кола, описаного навколо прямокутного трикутника лежить на середині гіпотенузи'
                    },
                    {
                        type: 'paragraph',
                        content: 'Центр кола, описаного навколо тупокутного трикутника лежить поза трикутником'
                    },
                    {
                        type: 'fornuma',
                        content: '../images/...' 
                    }
                ],
            },
            {
                name: 'Площа трикутника',
                elements: [
                    {
                        type: 'ul',
                        name: 'Загальні',
                        data: ['../images/...']
                    },
                    {
                        type: 'ul',
                        name: 'Спеціальні',
                        data: ['../images/...']
                    }
                ]
            }
        ],
        quadrilaterals: [
            {
                name: 'Чотирикутник та його елементи',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Чотирикутником називається фігура, яка складається з чотирьох точок і чотирьох відрізків, що послідовно їх сполучають. При цьому жодні три з даних точок не повинні лежати на одній прямій, а відрізки, що їх сполучають, не повинні перетинатися.'
                    },
                    {
                        type: 'Означення',
                        content: 'Вершини чотирикутника - це точки.'
                    },
                    {
                        type: 'Означення',
                        content: 'Сторони чотирикутника - це відрізки, що сполучають точки.'
                    },
                    {
                        type: 'Означення',
                        content: 'Діагоналі - це відрізки, що сполучають протилежні вершини чотирикутника.'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема(про суму кутів чотирикутника)',
                        content: 'Сума кутів чотирикутника = 360°'
                    },
                    {
                        type: 'ol',
                        name: 'Чотирикутники бувають',
                        data: [
                            'Опуклі (всі кути < 180°)',
                            'Неопуклі (один кут > 180°)'
                        ]
                    }
                ]
            },
            {
                name: 'Паралелограм',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Паралелограмом називається чотирикутник, у якого протилежні сторони паралельні.'
                    },
                    {
                        type: 'Означення',
                        content: 'Висота паралелограма - це відрізок, проведений з вершини під кутом 90° до протилежної сторони.'
                    },
                    {
                        type: 'Теорема',
                        name: 'про протилежні сторони паралелограма',
                        content: 'Протилежні сторони паралелограма рівні (AB = CD, BC = AD)'
                    },
                    {
                        type: 'Теорема',
                        name: 'про протилежні кути паралелограма',
                        content: 'Протилежні кути паралелограма рівні (∠A=∠C, ∠B=∠D)'
                    },
                    {
                        type: 'Теорема',
                        name: 'про діагоналі паралелограма',
                        content: 'Діагоналі паралелограма точкою перетину діляться навпіл (AO=OC, BO=OD)'
                    },
                    {
                        type: 'Властивість',
                        name: 'Властивість сусідніх кутів паралелограма',
                        content: 'Сума будь-яких двох сусідніх кутів паралелограма = 180°'
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки паралелограма',
                        data: [
                            'Якщо в чотирикутнику протилежні сторони паралельні, то цей чотирикутник - паралелограм',
                            'Якщо в чотирикутнику дві протилежні сторони паралельні і рівні, то цей чотирикутник - паралелограм',
                            'Якщо в чотирикутнику діагоналі точкою перетину діляться навпіл, то цей чотирикутник - паралелограм'
                        ]
                    }
                ]
            },
            {
                name: 'Прямокутник',
                elements: [
                    {
                        type: 'Означення',
                        name: 'Прямокутник - це паралелограм у якого всі кути прямі'
                    },
                    {
                        type: 'Теорема',
                        name: 'Прямокутник - це паралелограм у якого всі кути прямі',
                        content: 'Діагоналі прямокутники рівні'
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки прямокутника',
                        data: [
                            'Якщо діагоналі паралелограма рівні, то цей паралелограм - прямокутник'
                        ]
                    }
                ]
            },
            {
                name: 'Ромб',
                elements:[
                    {
                        type: 'Означення',
                        content: 'Ромб - це паралелограм, у якого всі сторони рівні'
                    },
                    {
                        type: 'Теорема',
                        name: 'про діагоналі ромба',
                        content: 'Діагоналі ромба перетинаються під прямим кутом і є бісектрисами його кутів'
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки ромба',
                        data: [
                            'Якщо діагоналі паралелограма перпендикулярні, то цей паралелограм - ромб',
                            'Якщо діагоналі паралелограма є бісектрисами його кутів, то цей паралелограм - ромб'
                        ]
                    }
                ]
            },
            {
                name: 'Квадрат',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Квадрат - це прямокутник, у якого всі сторони рівні'
                    }
                ]
            },
            {
                name: 'Трапеція',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Трапецією називається чотирикутник, у якого тільки 2 сторони паралельні'
                    },
                    {
                        type: 'Означення',
                        content: 'Середньою лінією трапеції називається відрізок, який сполучає середини бічних сторін'
                    },
                    {
                        type: 'Означення',
                        content: 'Прямокутна трапеція - це трапеція, у якої два сусідніх кути дорівнюють 90°'
                    },
                    {
                        type: 'Означення',
                        content: 'Рівнобічна трапеція - це трапеція, в якої бічні сторони рівні'
                    },
                    {
                        type: 'paragraph',
                        content: 'У рівнобічній трапеції кути при основі рівні'
                    },
                    {
                        type: 'Теорема',
                        name: 'про середню лінію трапеції',
                        content: 'Середня лінія трапеція паралельна основам і дорівнює їх півсумі'
                    }
                ]
            },
            {
                name: 'Вписані і описані чотирикутники',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Коло називається описаним навколо чотирикутника, якщо воно проходить через всі його вершини',
                    },
                    {
                        type: 'Означення',
                        content: 'Коло називається вписаним в чотирикутник, якщо воно дотикається до всіх його сторін'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема(про вписаний чотирикутник)',
                        content: 'Навколо чотирикутника можна описати коло, якщо сума його протилежних кутів = 180°'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема(про описаний чотирикутник)',
                        content: 'У чотирикутник можна вписати коло, якщо суми його протилежних сторін - рівні'
                    }
                ]
            },
            {
                name: 'Площі',
                elements: [
                    {
                        type: 'ul',
                        name: 'Довільного чотирикутника',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Паралелограма (можна використати для всіх інших, крім трапеції)',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Прямокутника',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Квадрата',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Ромба',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Трапеції',
                        data: [
                            '../images/'
                        ]
                    }
                ]
            }
        ],
        poligons: [
            {
                name: 'Геометрія. Точка і пряма. Властивості точок і прямих.',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Планіметрія - це розділ геометрії, де вивчаються властивості фігур на площині'
                    },
                    {
                        type: 'Означення',
                        content: 'Промінь - це відрізок, що має початок і не має кінця'
                    },
                    {
                        type: 'Означення',
                        content: 'Доповняльні промені - це два промені, які мають спільний початок і лежать на одній прямій, доповнюючи один одного до прямої'
                    },
                    {
                        type: 'Означення',
                        content: 'Рівні відрізки - це відрізки, які можна сумістити накладанням'
                    },
                    {
                        type: 'paragraph',
                        content: 'Основні фігури на площині - це точка і пряма'
                    },
                    {
                        type: 'Властивість',
                        name: 'Основна властивість прямої',
                        content: 'Через будь-які дві точки можна провести пряму і до того ж тільки одну'
                    },
                    {
                        type: 'Властивість',
                        name: 'Основна властивість довжини відрізка',
                        content: 'Кожний відрізок має певну довжину > 0. Довжина відрізка = сумі довжин частин, на які він розбитий будь-якою точкою'
                    },
                ]
            },
            {
                name: 'Кут. Вимірювання кутів',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Кут - це геометрична фігура, яка складається з двох променів, які виходять з однієї точки'
                    },
                    {
                        type: 'Означення',
                        content: 'Розгорнутий кут - це кут сторони якого є доповняльними променями.'
                    },
                    {
                        type: 'Означення',
                        content: 'Бісектриса кута - це промінь, який виходить з вершини кута і ділить цей кут на 2 рівних кути'
                    },
                    {
                        type: 'Означення',
                        content: 'Суміжні кути - це кути, в яких одна сторона в них спільна, а дві інші сторони цих кутів є доповняльними променями'
                    },
                    {
                        type: 'Означення',
                        content: 'Вертикальні кути - це кути, в яких обидві сторони одного кута є продовженням сторін другого.'
                    },
                    {
                        type: 'Властивість',
                        name: 'Основна властивість вимірювання кутів',
                        content: 'Кожний кут має градусну міру більшу від нуля. Розгорнутий кут = 180°'
                    },
                    {
                        type: 'Параграф',
                        content: 'Градусна міра кута дорівнює сумі градусних мір кутів на які він розбивається будь-яким променем, що проходить між його сторонами.'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема (про суміжні кути)',
                        content: 'Сума сусідніх кутів = 180°'
                    }
                ]
            },
            {
                name: 'Перпендикулярні прямі',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Перпендикулярні прямі - це прямі, що перетинаються під прямим кутом'
                    },
                    {
                        type: 'Означення',
                        content: 'Перпендикулярні відрізки - це відрізки, що лежать на перпендикулярних прямих'
                    }
                ]
            },
            {
                name: 'Паралельні прямі, ознака паралельності прямих',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Паралельні прямі - це прямі, що не перетинаються і лежать в одній площині'
                    },
                    {
                        type: 'Означення',
                        content: 'Внутрішні різносторонні кути - це кути, які лежать з різних боків від січної с між прямими а і b'
                    },
                    {
                        type: 'Означення',
                        content: 'Внутрішні односторонні кути - кути, які лежать з одного боку від січної с між прямими а і b'
                    },
                    {
                        type: 'Означення',
                        content: 'Відповідні кути - це два кути, які знаходяться в «одному місці» щодо поперечного, але на різних лініях'
                    },
                    {
                        type: 'Аксіома',
                        name: 'Аксіома (паралельності прямих)',
                        content: 'Через точку, яка не лежить на даній прямій проходить тільки одна пряма, паралельна даній'
                    },
                    {
                        type: 'ol',
                        name: 'Теорема (ознака паралельності прямих)',
                        data: [
                            'Якщо внутрішні різносторонні кути, утворені при перетині двох прямих січною, рівні, то прямі паралельні',
                            'Якщо сума внутрішніх односторонніх кутів = 180°, то такі прямі паралельні',
                            'Якщо відповідні кути рівні, то прямі паралельні'
                        ]
                    }
                ]
            }
        ],
        trigonometry: [
            {
                name: 'Тригонометричні функції гострого кута прямокутного трикутника',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Синусом(sin) гострого кута прямокутного трикутника називається відношення протилежного катета до гіпотенузи'
                    },
                    {
                        type: 'Означення',
                        content: 'Косинусом(cos) гострого кута прямокутного трикутника називається відношення прилеглого катета до гіпотенузи'
                    },
                    {
                        type: 'Означення',
                        content: 'Тангенсом(tg) гострого кута прямокутного трикутника називається відношення протилежного катета до прилеглого катета'
                    },
                    {
                        type: 'Означення',
                        content: 'Котангенсом(ctg) гострого кута прямокутного трикутника називається відношення прилеглого катета до протилежного катета'
                    },
                    {
                        type: 'table',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Тригонометричні формули',
                elements: [
                    {
                        type: 'formula',
                        name: 'Основна тригонометрична тотожність',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        name: 'Формули зведення',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Синуси, косинуси, тангенси кутів від 0° до 180°',
                elements: [
                    {
                        type: 'table',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        name: 'cos, tg, ctg тупого кута є число від’ємне, а sin тупого кута - додатнє',
                        content: '../images/...'
                    }
                ]
            }
        ],
        teorems: [
            {
                name: 'Теорема Піфагора',
                elements: [
                    {
                        type: 'Теорема',
                        name: 'Теорема (Піфагора)',
                        content: 'У прямокутному трикутнику квадрат гіпотенузи дорівнює сумі квадратів катетів'
                    }
                ]
            },
            {
                name: 'Теорема косинусів',
                elements: [
                    {
                        type: 'Теорема',
                        name: 'Теорема (косинусів)',
                        content: 'Квадрат сторони трикутника дорівнює сумі квадратів  двох інших сторін мінус подвоєний добуток цих сторін та косинус кута між ними',
                        cons: 'Сума квадратів всіх сторін паралелограма дорівнює сумі квадратів його діагоналей'
                    }
                ]
            },
            {
                name: 'Теорема синусів',
                elements: [
                    {
                        type: 'Теорема',
                        name: 'Теорема(синусів)',
                        content: 'Сторони трикутника відносяться до синусів протилежних кутів',
                        cons: 'Відношення сторін до синусів кутів, що лежать проти них, дорівнює подвоєному радіусу кола, описаного навколо цього трикутника'
                    }
                ]
            },
            {
                name: 'Теорема Фалеса і теорема про пропорційні відрізки',
                elements: [
                    {
                        type: 'Теорема',
                        name: 'Теорема Фалеса',
                        content: 'Якщо паралельні прямі, які перетинають сторони кута відтинають на одній його стороні рівні відрізки, то вони відтинають рівні відрізки і на другій стороні кута'
                    },
                    {
                        type: 'Теорема',
                        name: 'Теорема (про пропорційні відрізки)',
                        content: 'Паралельні прямі, які перетинають сторони кута, відтинають від сторін кута пропорційні відрізки'
                    },
                    {
                        type: 'Властивість',
                        name: 'Властивість медіан трикутника',
                        content: 'Усі три медіани трикутника перетинаються в одній точці і точкою перетину діляться у відношенні 2:1 починаючи від вершини трикутника'
                    },
                    {
                        type: 'Властивість',
                        name: 'Властивість бісектриси трикутника',
                        content: 'Бісектриса трикутника ділить його сторону на відрізки пропорційні прилеглим до них сторонам'
                    }
                ]
            }
        ],
        vectors: [
            {
                name: 'Вектори',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Вектором називається напрямлений відрізок'
                    },
                    {
                        type: 'paragraph',
                        content: 'Вектори бувають однонапрямлені, або протилежнонапрямлені'
                    },
                    {
                        type: 'Означення',
                        content: 'Модулем(абсолютною величиною вектора) називається довжина відрізка, який зображує вектор'
                    },
                    {
                        type: 'Означення',
                        content: 'Нульовий вектор - це вектор, в якого початок збігається з кінцем'
                    },
                    {
                        type: 'Означення',
                        content: 'Два вектори називаються рівними, якщо вони однаково напрямлені та рівні за абсолютною величиною'
                    },
                    {
                        type: 'Означення',
                        content: 'Вектори називаються колінеарними, якщо вони лежать на || прямих, або на одній прямій'
                    }
                ]
            },
            {
                name: 'Координати вектора',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Рівні вектори мають однакові координати'
                    }
                ]
            },
            {
                name: 'Додавання векторів',
                elements: [
                    {
                        type: 'formula',
                        name: 'Алгебраїчна сума векторів',
                        content: '../image/...'
                    },
                    {
                        type: 'ol',
                        name: 'Є 2 правила додавання векторів',
                        data: [
                            'Правило трикутника: Переносимо другий вектор на початок першого і відрізок, що з`єднує початок першого і кінець другого вектора - це сума цих векторів',
                            'Правило паралелограма: Переносимо початок другого вектора до початку першого, домальовуємо паралелограм і діагональ, що виходить із початку обох векторів і є сумою двох векторів'
                        ]
                    }
                ]
            },
            {
                name: 'Віднімання векторів',
                elements: [
                    {
                        type: 'paragraph',
                        content: 'Для того, щоб відняти два вектори, ми домножуємо другий вектор на -1 і додаємо їх'
                    }
                ]
            },
            {
                name: 'Множення вектора на число',
                elements: [
                    {
                        type: 'formula',
                        name: 'Добутком вектора на число є вектор, координати якого є добутком відповідних координат даного вектора на дане число',
                        content: '../images/...'
                    },
                    {
                        type: 'formula',
                        name: 'Модуль вектора',
                        content: '../images/...'
                    },
                    {
                        type: 'ul',
                        name: 'Напрям ka',
                        data: [
                            'Збігається з напрямом a, якщо k > 0',
                            'Протилежний напряму a, якщо k < 0'
                        ]
                    },
                    {
                        type: 'formula',
                        name: 'У колінеарних векторів відповідні координати пропорційні',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Скалярний добуток векторів',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Кут між векторами',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Кут між векторами - це кут, який утворюють вектори, три перенесенні їх так, щоб їх початки збігались'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            }
        ],
        other: [
            {
                name: 'Відстань між точками із заданими координатами',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Координата середини відрізка',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Рівняння кола',
                elements: [
                    {
                        type: 'formula',
                        content: '../images'
                    }
                ]
            },
            {
                name: 'Рівняння кола',
                elements: [
                    {
                        type: 'formula',
                        name: 'Рівняння прямої має вигляд',
                        content: '../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Рівняння прямої не можна перетворити на kx+b, якщо b=0'
                    }
                ]
            },
            {
                name: 'Кутовий коефіцієнт прямої',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Якщо прямі паралельні, то в них однаковий кутовий коефіцієнт'
                    }
                ]
            },
            {
                name: 'Геометричні перетворення',
                elements: [
                    {
                        type: 'Означення',
                        content: 'Перетворення фігури F називають переміщенням(рухом), якщо воно зберігає відстань між точками'
                    },
                    {
                        type: 'Означення',
                        content: 'Паралельне перенесення - це перетворення, при якому точки зміщуються тому самому напрямі на ту саму відстань'
                    },
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Симетрія відносно прямої(осьова симетрія)',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Симетрія відносно точки(центральна симетрія)',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    }
                ]
            },
            {
                name: 'Поворот',
                elements: [
                    {
                        type: 'formula',
                        content: '../images/...'
                    },
                    {
                        type: 'paragraph',
                        content: 'Поворот може здійснюватись за або проти годинникової стрілки'
                    },
                    {
                        type: 'paragraph',
                        content: 'Поворот задається кутом, центром і напрямком повороту'
                    }
                ]
            },
            {
                name: 'Площі подібних фігур',
                elements: [
                    {
                        type: 'formula',
                        name: 'Відношення подібних фігур дорівнює квадрату коефіцієнта подібності',
                        content: '../images/...'
                    },
                ]
            }
        ]
    }
}

export default pages