const pages = {
    algebra: {

    },

    geometry: {
        triangles: [
            {
                name: 'Трикутник',
                defs: ['Трикутником називається геометрична фігура, що складається з трьох точок (вершин трикутника), які не лежать на одній прямій, і трьох відрізків (сторін трикутника), що попарно сполучають ці точки'],
                teorems: [
                    {
                        name: 'про суму кутів трикутника',
                        content: 'Сума кутів трикутника дорівнює 180°',
                        cons: undefined
                    }
                ],
                lists: [
                    {
                        type: 'ol',
                        name: 'Види трикутників за кутами',
                        data: [
                            'гострі (всі кути гострі',
                            'прямокутні (один кут прямий, а 2 інші - гострі)',
                            'тупокутні (один кут тупий, а 2 інші - гострі)'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Щоб встановити вид трикутника, якщо відомо сторони a, b, c, c - найбільша сторона',
                        data: [
                            'с2> a2+b2 - тупокутній', 
                            'с2= a2+b2 - прямокутний', 
                            'с2< a2+b2 - гострокутній'
                        ]
                    }
                ]
            },
            
            {
                name: 'Додаткові елементи',
                defs: [
                    'Висота - це перпендикуляр, опущений з вершини трикутника на пряму, яка містить протилежну сторону',
                    'Медіана - це відрізок, який сполучає вершину трикутника з серединою протилежної сторони',
                    'Бісектриса - це відрізок, який виходить з вершини трикутника і ділить кут навпіл',
                    'Середня лінія - це відрізок, який сполучає середини двох його сторін',
                    'Зовнішній кут трикутника - це кут, суміжний з кутом цього трикутника'
                ],
                teorems: [
                    {
                        name: 'властивість середньої лінії трикутника',
                        content: 'Середня лінія трикутника, яка сполучає середини двох його сторін паралельна третій стороні і дорівнює її половині',
                        cons: undefined
                    },

                    {
                        name: 'про зовнішній кут трикутника',
                        content: 'Зовнішній кут трикутника = сумі двох кутів трикутника, несуміжних з ним',
                        cons: undefined
                    },

                    {
                        name: 'про сторони і кути трикутника',
                        content: 'У трикутнику навпроти найбільшої сторони лежить найбільший кут',
                        cons: undefined
                    }
                ]
            },
            {
                name: 'Рівні трикутники',
                defs: [
                    'Два трикутники є рівними, якщо в них всі сторони і кути рівні'
                ],
                lists: [
                    {
                        type: 'ol',
                        name: 'Ознаки рівності трикутників',
                        data: [
                            'Якщо 2 сторони і кут між ними одного трикутника = відповідно двом сторонам і куту між ними 2-го трикутника, то такі трикутники рівні',
                            'Якщо сторона і 2 прилеглі до неї кути одного трикутника відповідно дорівнюють стороні і 2-м прилеглим до неї кутам 2-го трикутника, то такі трикутники рівні',
                            'Якщо 3 сторони одного трикутника відповідно = 3-м сторонам іншого трикутника, то такі трикутники рівні'
                        ]
                    }
                ]
            },

            {
                name: 'Подібні трикутники',
                defs: [
                    'Два трикутника називають подібними, якщо їхні кути відповідно рівні, а сторони одного трикутника пропорційні відповідним сторонам другого трикутника'
                ],
                lema: {
                    name: 'про подібні трикутники',
                    content: 'Пряма, яка паралельна стороні даного трикутника відтинає його подібний'
                },
                lists: [
                    {
                        type: 'ul',
                        name: 'Ознаки подібності трикутників',
                        data: [
                            {
                                name: 'Ознака подібності трикутників за двома кутами',
                                content: 'Якщо два кути одного трикутника дорівнюють двом кутам другого трикутника, то такі трикутники подібні'
                            },
                            {
                                name: 'Ознака подібності трикутника за двома сторонами і кутом між ними',
                                content: 'Якщо дві сторони одного трикутника пропорційні двом сторонам другого трикутника, а кути, утворені цими сторонами рівні, то такі трикутники подібні'
                            },
                            {
                                name: 'Ознака подібності трикутників за трьома сторонами',
                                content: 'Якщо три сторони одного трикутника пропорційні трьом сторонам другого трикутника, то такі трикутники подібні'
                            }
                        ]
                    }
                ]
            },

            {
                name: 'Рівнобедрений трикутник',
                defs: [
                    'Рівнобедрений трикутник — трикутник, у якого дві рівні сторони',
                    'Рівносторонній трикутник — трикутник, у якого всі сторони рівні'
                ],
                teorems: [
                    {
                        name: 'про кути рівнобедреного трикутника',
                        content: 'У рівнобедреному трикутнику кути при основі рівні',
                        cons: 'У рівностороннього трикутника всі кути рівні'
                    },
                    {
                        name: 'про бісектрису рівнобедреного трикутника',
                        content: 'У рівнобедреному трикутнику бісектриса, проведена до основи є медіаною і висотою',
                        cons: undefined
                    }
                ],
                lists: [
                    {
                        type: 'ol',
                        name: 'Ознаки рівнобедреного трикутника',
                        data: [
                            'Якщо медіана трикутника є його висотою, то цей трикутник рівнобедрений',
                            'Якщо бісектриса трикутника є його висотою, то цей трикутник рівнобедрений',
                            'Якщо медіана трикутника є його бісектрисою, то цей трикутник рівнобедрений',
                            'Якщо в трикутнику 2 кути рівні, то цей трикутник рівнобедрений',
                            'Якщо в трикутнику всі кути рівні, то цей трикутник рівносторонній'
                        ]
                    }
                ]
            },
            {
                name: 'Прямокутний трикутник',
                defs: [
                    'Прямокутним трикутником називають трикутник, один із кутів якого прямий',
                    'Катет — сторона прямокутного трикутника, прилегла до прямого кута',
                    'Гіпотенуза — сторона прямокутного трикутника, яка лежить навпроти прямого кута'
                ],
                lists: [
                    {
                        type: 'ol',
                        name: 'Ознаки рівностей прямокутних трикутників',
                        data: [
                            'Якщо гіпотенуза та катети одного прямокутного трикутника відповідно дорівнюють гіпотенузі та катетам другого прямокутного трикутника, то такі трикутника рівні',
                            'За двома катетами',
                            'За катетом і прилеглим гострим кутом',
                            'За катетом і протилежним гострим кутом',
                            'За гіпотенузою і гострим кутом'
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Властивості прямокутних трикутників',
                        data: [
                            'У прямокутному трикутнику гіпотенуза більша за катет',
                            'Перпендикуляр завжди менший від похилої',
                            'Катет, який лежить навпроти кута 30° дорівнює половині гіпотенузи',
                            'Якщо в прямокутному трикутнику катет дорівнює половині гіпотенузи, то кут, який лежить навпроти цього катета дорівнює 30°'
                        ]
                    }
                ],
                ps:[
                    'Розв’язати прямокутний трикутник означає знайти невідомі сторони і кути (всього 5: 2-відомі; 3-невідомі)'
                ]
            },
            {
                name: 'Метричні співвідношення в прямокутному трикутнику',
                ps: [
                    'Висота прямокутного трикутника, проведена до гіпотенузи ділить трикутник на 2 подібних прямокутних трикутника, кожен з яких подібний даному',
                    'Квадрат висоти прямокутного трикутника, проведеної до гіпотенузи дорівнює добутку проекцій катетів на гіпотенузу',
                    'Квадрат катета дорівнює добутку гіпотенузи та проекції цього катета на гіпотенузу'
                ]
            },
            {
                name: 'Коло, вписане в трикутник',
                defs: [
                    'Коло називається вписаним у трикутник, якщо воно дотикається до всіх його сторін'
                ],
                ps: [
                    'У будь-який трикутник можна вписати коло',
                    'Центр кола, вписаного в трикутник - це точка перетину бісектрис'
                ],
                formula: '../images/...'
            },
            {
                name: 'Коло, описане навколо трикутника',
                defs: [
                    'Коло називається описаним навколо трикутника, якщо воно проходить через усі його вершини'
                ],
                ps: [
                    'Навколо будь-якого трикутника можна описати коло',
                    'Центр кола, описаного навколо трикутника - це точка перетину серединних перпендикулярів до сторін трикутника',
                    'Центр кола, описаного навколо прямокутного трикутника лежить на середині гіпотенузи',
                    'Центр кола, описаного навколо тупокутного трикутника лежить поза трикутником'
                ],
                formula: '../images/...'
            },
            {
                name: 'Тригонометричні функції гострого кута прямокутного трикутника',
                defs: [
                    'Синусом(sin) гострого кута прямокутного трикутника називається відношення протилежного катета до гіпотенузи',
                    'Косинусом(cos) гострого кута прямокутного трикутника називається відношення прилеглого катета до гіпотенузи',
                    'Тангенсом(tg) гострого кута прямокутного трикутника називається відношення протилежного катета до прилеглого катета',
                    'Котангенсом(ctg) гострого кута прямокутного трикутника називається відношення прилеглого катета до протилежного катета'
                ],
                vals_img: '../images/...'
            },
            {
                name: 'Тригонометричні формули',
                lists: [
                    {
                        type: 'ul',
                        name: 'Основна тригонометрична тотожність', 
                        data: ['../images/...']
                    },
                    {
                        type: 'ul',
                        name: 'Формули зведення',
                        data: ['../images/...']
                    }
                ]

            },
            {
                name: 'Площа трикутника',
                lists: [
                    {
                        type: 'ul',
                        name: 'Загальні',
                        data: ['../images/...']
                    },
                    {
                        type: 'ul',
                        name: 'Спеціальні',
                        data: ['../images/...']
                    }
                ]
            },
            {
                name: 'Теореми',
                teorems: [
                    {
                        name: 'Піфагора',
                        content: 'У прямокутному трикутнику квадрат гіпотенузи дорівнює сумі квадратів катетів',
                        cons: undefined
                    },
                    {
                        name: 'косинусів',
                        content: 'Квадрат сторони трикутника дорівнює сумі квадратів  двох інших сторін мінус подвоєний добуток цих сторін та косинус кута між ними',
                        cons: 'Сума квадратів всіх сторін паралелограма дорівнює сумі квадратів його діагоналей'
                    },
                    {
                        name: 'синусів',
                        content: 'Сторони трикутника відносяться до синусів протилежних кутів',
                        cons: 'Відношення сторін до синусів кутів, що лежать проти них, дорівнює подвоєному радіусу кола, описаного навколо цього трикутника'
                    }

                ]
            },

        ],
        quadrilaterals: [
            {
                name: 'Чотирикутник та його елементи',
                defs: [
                    'Чотирикутником називається фігура, яка складається з чотирьох точок і чотирьох відрізків, що послідовно їх сполучають. При цьому жодні три з даних точок не повинні лежати на одній прямій, а відрізки, що їх сполучають, не повинні перетинатися.',
                    'Вершинами чотирикутника - це точки',
                    'Сторони чотирикутника - це відрізки, що сполучають точки',
                    'Діагоналі - це відрізки, що сполучають протилежні вершини чотирикутника'
                ],
                teorems: [
                    {
                        name: 'про суму кутів чотирикутника',
                        content: 'Сума кутів чотирикутника = 360°',
                        cons: undefined
                    }
                ],
                lists: [
                    {
                        type: 'ol',
                        name: 'Чотирикутники бувають',
                        data: [
                            'Опуклі (всі кути < 180°)',
                            'Неопуклі (один кут > 180°)'
                        ]
                    }
                ]
            },
            {
                name: 'Паралелограм',
                defs: [
                    'Паралелограмом називається чотирикутник, у якого протилежні сторони паралельні',
                    'Висота паралелограма - це відрізок, проведений з вершини під кутом 90° до протилежної сторони'
                ],

                teorems: [
                    {
                        name: 'про протилежні сторони паралелограма',
                        content: 'Протилежні сторони паралелограма рівні (AB = CD, BC = AD)',
                        cons: undefined
                    },
                    {
                        name: 'про протилежні кути паралелограма',
                        content: 'Протилежні кути паралелограма рівні (∠A=∠C, ∠B=∠D)',
                        cons: undefined
                    },
                    {
                        name: 'про діагоналі паралелограма',
                        content: 'Діагоналі паралелограма точкою перетину діляться навпіл (AO=OC, BO=OD)',
                        cons: undefined
                    },
                ],

                lists: [
                    {
                        type: 'ul',
                        name: 'Властивість сусідніх кутів паралелограма',
                        data: ['Сума будь-яких двох сусідніх кутів паралелограма = 180°']
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки паралелограма',
                        data: [
                            'Якщо в чотирикутнику протилежні сторони паралельні, то цей чотирикутник - паралелограм',
                            'Якщо в чотирикутнику дві протилежні сторони паралельні і рівні, то цей чотирикутник - паралелограм',
                            'Якщо в чотирикутнику діагоналі точкою перетину діляться навпіл, то цей чотирикутник - паралелограм'
                        ]
                    }
                ]
            },
            {
                name: 'Прямокутник',
                defs: [
                    'Прямокутник - це паралелограм у якого всі кути прямі'
                ],
                teorems: [
                    {
                        name: 'Прямокутник - це паралелограм у якого всі кути прямі',
                        content: 'Діагоналі прямокутники рівні'
                    }
                ],
                lists: [
                    {
                        type: 'ul',
                        name: 'Ознаки прямокутника',
                        data: [
                            'Якщо діагоналі паралелограма рівні, то цей паралелограм - прямокутник'
                        ]
                    }
                ]
            },
            {
                name: 'Ромб',
                defs: [
                    'Ромб - це паралелограм, у якого всі сторони рівні'
                ],
                teorems: [
                    {
                        name: 'про діагоналі ромба',
                        content: 'Діагоналі ромба перетинаються під прямим кутом і є бісектрисами його кутів'
                    }
                ],
                lists: [
                    {
                        type: 'ul',
                        name: 'Ознаки ромба',
                        data: [
                            'Якщо діагоналі паралелограма перпендикулярні, то цей паралелограм - ромб',
                            'Якщо діагоналі паралелограма є бісектрисами його кутів, то цей паралелограм - ромб'
                        ]
                    }
                ]
            },
            {
                name: 'Квадрат',
                defs: [
                    'Квадрат - це прямокутник, у якого всі сторони рівні'
                ]
            },
            {
                name: 'Трапеція',
                defs: [
                    'Трапецією називається чотирикутник, у якого тільки 2 сторони паралельні',
                    'Середньою лінією трапеції називається відрізок, який сполучає середини бічних сторін'
                ],
                lists: [
                    {
                        type: 'ul',
                        name: 'Види трапецій',
                        data: [
                            'Прямокутна (1 з кутів = 90°)',
                            'Рівнобічна (бічні сторони рівні)'
                        ]
                    }
                ],

                ps: [
                    'У рівнобічній трапеції кути при основі рівні'
                ],

                teorems: [
                    {
                        name: 'про середню лінію трапеції',
                        content: 'Середня лінія трапеція паралельна основам і дорівнює їх півсумі'
                    }
                ]
            },
            {
                name: 'Вписані і описані чотирикутники',
                defs: [
                    'Коло називається описаним навколо чотирикутника, якщо воно проходить через всі його вершини',
                    'Коло називається вписаним в чотирикутник, якщо воно дотикається до всіх його сторін'
                ],
                teorems: [
                    {
                        name: 'про вписаний чотирикутник',
                        content: 'Навколо чотирикутника можна описати коло, якщо сума його протилежних кутів = 180°'
                    },
                    {
                        name: 'про описаний чотирикутник',
                        content: 'У чотирикутник можна вписати коло, якщо суми його протилежних сторін - рівні'
                    }
                ]
            },
            {
                name: 'Площі',
                lists: [
                    {
                        type: 'ul',
                        name: 'Довільного чотирикутника',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Паралелограма (можна використати для всіх інших, крім трапеції)',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Прямокутника',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Квадрата',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Ромба',
                        data: [
                            '../images/'
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Трапеції',
                        data: [
                            '../images/'
                        ]
                    }
                ]
            }
        ]
    }
}

export default pages