type Pages = {
    [key: string]: {}
}

export type Page = {
    [key: string]: ArticleData[]
}

export type ArticleData = {
    name: string,
    elements: SectionType[]
}

export type SectionType = {
    type: string,
    [key: string]: any
}

const pages: Pages = {
    algebra: {
        'Рівняння': [
            {
                name: 'Лінійне рівняння з однією змінною',
                elements: [
                    {
                        type: 'p',
                        content: 'Рівняння виду ax = b, де a, b - будь-які числа, x - змінна, називають лінійним рівнянням з однією змінною'
                    },
                    {
                        type: 'ol',
                        name: 'Кількість розв`язків  рівняння',
                        data: [
                            {
                                type: 'p',
                                content: 'ax = b, a != 0; x = a/b'
                            },
                            {
                                type: 'p',
                                content: 'ax = b, a=0, b != 0; немає розв’язку'
                            },
                            {
                                type: 'p',
                                content: 'ax = b, a=0, b=0; безліч розв’язків'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Розв’язання задач',
                        data: [
                            {
                                type: 'p',
                                content: 'Визначити невідоме'
                            },
                            {
                                type: 'p',
                                content: 'Скласти коротку умову'
                            },
                            {
                                type: 'p',
                                content: 'Скласти рівняння'
                            },
                            {
                                type: 'p',
                                content: 'Розв`язати рівняння'
                            },
                            {
                                type: 'p',
                                content: 'З’ясувати належність розв’язку всім невідомим'
                            },
                            {
                                type: 'p',
                                content: 'Написати відповідь'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Тотожно рівні вирази. Тотожність',
                elements: [
                    {
                        type: 'p',
                        content: 'Два вирази відповідні значення яких рівні при будь-яких значеннях змінних називають тотожними або тотожно рівними'
                    },
                    {
                        type: 'p',
                        content: 'Тотожність - це рівність, яка правильна при будь-яких значеннях змінних'
                    }
                ]
            },
            {
                name: 'Рівняння з двома змінними. Лінійне рівняння з двома змінними',
                elements: [
                    {
                        type: 'p',
                        content: 'Розв’язок рівняння з двома змінними - це пара значень змінних, яка перетворює рівняння в правильну рівність'
                    },
                    {
                        type: 'p',
                        content: 'Лінійним рівнянням з двома змінними називають рівняння виду ax+by=c, де a, b, c-деякі числа'
                    }
                ]
            },
            {
                name: 'Система рівняння з двома змінними',
                elements: [
                    {
                        type: 'p',
                        content: 'Розв’язком системи рівнянь з двома змінними називають пару чисел, яка перетворює кожне рівняння на правильну рівність'
                    },
                    {
                        type: 'p',
                        content: 'Система може мати 1, безліч та 0 розв’язків'
                    },
                    {
                        type: 'ol',
                        name: 'Є 3 способи розв’язування систем лінійних рівнянь з двома змінними',
                        data: [
                            {
                                type: 'p',
                                content: 'графічний'
                            },
                            {
                                type: 'p',
                                content: 'підстановки'
                            },
                            {
                                type: 'p',
                                content: 'додавання'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Графічний метод',
                        data: [
                            {
                                type: 'p',
                                content: 'Будуємо графік рівнянь, що входять до системи'
                            },
                            {
                                type: 'p',
                                content: 'Знайти координати точки перетину графіків'
                            },
                            {
                                type: 'p',
                                content: 'Отримана пара чисел - це розв’язок системи'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Метод підстановки',
                        data: [
                            {
                                type: 'p',
                                content: 'З першого рівняння системи виражаємо одну з змінних через змінну другу'
                            },
                            {
                                type: 'p',
                                content: 'Підставимо отриманий вираз замість змінної цієї змінної у друге рівняння системи'
                            },
                            {
                                type: 'p',
                                content: 'Розв`яжемо утворене рівняння з однією змінною, знайдемо першу змінну'
                            },
                            {
                                type: 'p',
                                content: 'Знайдемо відповідне значення змінної другої змінної, підставивши значення змінної першої, у вираз знайдений на першому кроці'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Метод додавання',
                        data: [
                            {
                                type: 'p',
                                content: 'Приводимо коефіцієнти при одній змінній до протилежних чисел і додаємо почленно ліві й праві частини рівнянь'
                            },
                            {
                                type: 'p',
                                content: 'Підставимо знайдене значення другої змінної в одне з рівнянь системи і знайдемо першу змінну'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Квадратні рівняння',
                elements: [
                    {
                        type: 'p',
                        content: 'Квадратним називається рівняння виду ax2+bx+c=0, де x-змінна, a,b,c-деякі числа, a != 0'
                    },
                    {
                        type: 'p',
                        content: 'a, b, c - коефіцієнти квадратного рівняння'
                    },
                    {
                        type: 'p',
                        content: 'Якщо a = 1, то квадратне рівняння називають зведеним'
                    },
                    {
                        type: 'p',
                        content: 'Якщо хоча б один з коефіцієнтів b або c = 0, то квадратне рівняння називається неповним'
                    }
                ]
            },
            {
                name: 'Формула коренів квадратного рівняння',
                elements: [
                    {
                        type: 'p',
                        content: 'Дискримінінтом квадратного рівняння називають вираз b2-4ac'
                    },
                    {
                        type: 'p',
                        content: 'D=b^2-4ac'
                    },
                    {
                        type: 'ol',
                        name: 'Кількість коренів квадратного рівняння',
                        data: [
                            '../images/...',
                            '../images/...',
                            '../images/...'
                        ]
                    }
                ]
            },
            {
                name: 'Теорема Вієта',
                elements: [
                    {
                        type: 't',
                        name: 'Теорема (Вієта)',
                        content: 'Якщо зведене квадратне рівняння має два корені, то їх сума дорівнює другому коефіцієнту з протилежним знаком, а добуток третьому коефіцієнту'
                    },
                    {
                        type: 'p',
                        content: 'x^2+bx+c=0 <br>x1+x2=-b <br>x1*x2=c'
                    }
                ]
            },
            {
                name: 'Квадратний тричлен',
                elements: [
                    {
                        type: 'p',
                        content: 'Квадратним тричленом називається вираз виду ax2+bx+c=0, де x-змінна, a,b,c-деякі числа, a0'
                    },
                    {
                        type: 'p',
                        content: 'Коренем квадратного тричлена називається значення змінної, при якому значення квадратного тричлена дорівнює 0'
                    },
                    {
                        type: 'ol',
                        name: 'Розкладання на тричлен',
                        data: [
                            {
                                type: 'p',
                                content: 'D>0, то даний квадратний тричлен можна розкласти на множники <br>ax^2+bx+c=a(x-x1)(x-x2), де x1, x2 - корені квадратного тричлена'
                            },
                            {
                                type: 'p',
                                content: 'D<0, то тричлен не можна розкласти на множники'
                            },
                            {
                                type: 'p',
                                content: 'D=0, то тричлем можна розкласти на множники <br>ax^2+bx+c=a(x-x1)2, де x1, x2 - корені квадратного тричлена'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Біквадратне рівняння',
                elements: [
                    {
                        type: 'p',
                        content: 'Це рівняння вигляду ax^4+bx^2+c=0, де а — не дорівнює 0'
                    },
                    {
                        type: 'ol',
                        name: 'Розв’язання',
                        data: [
                            {
                                type: 'p',
                                content: 'Замінюємо змінну x^2 на t'
                            },
                            {
                                type: 'p',
                                content: 'Розв’язуємо утворене квадратне рівняння: at^2+bt+c=0'
                            },
                            {
                                type: 'p',
                                content: 'Розв’язуємо утворене квадратне рівняння: at^2+bt+c=0'
                            },
                            {
                                type: 'p',
                                content: 'Отримані значення перевіряємо і записуємо у відповідь'
                            }
                        ]
                    }
                ]
            }
        ],
        'Нерівності': [
            {
                name: 'Числові нерівності',
                elements: [
                    {
                        type: 'p',
                        content: 'Якщо обидві частини нерівності є числа, то її називають числовою'
                    },
                    {
                        type: 'p',
                        content: '5>3-правильна'
                    },
                    {
                        type: 'p',
                        content: '5<3-неправильна'
                    },
                    {
                        type: 'p',
                        content: 'Нерівності бувають строгі і нестрогі'
                    },
                    {
                        type: 'p',
                        content: '10>2-строга'
                    },
                    {
                        type: 'p',
                        content: '5>=3-нестрога'
                    },
                    {
                        type: 'p',
                        content: 'Число a>b, якщо a-b>0; a<b, якщо a-b<0'
                    },
                    {
                        type: 'ol',
                        name: 'Властивості',
                        data: [
                            {
                                type: 'p',
                                content: 'a>b, b>c, тоді a>c'
                            },
                            {
                                type: 'p',
                                content: 'a>b | +c => a+c>b+c, c-будь-яку число'
                            },
                            {
                                type: 'p',
                                content: 'a>b | *c => ac>bc, c>0<br>a>b | *c => ac<bc, c<0'
                            },
                            {
                                type: 'p',
                                content: 'a>b (a>0, b>0) => 1/a<1/b'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Почленне додавання і множення нерівностей',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'np',
                                name: 'Нерівності з однаковими знаками можна почленно додавати',
                                content: 'a<b ; c<d ; a+c<b+d'
                            },
                            {
                                type: 'np',
                                name: 'Нерівності з однаковими знаками можна почленно перемножити, якщо їх ліві та праві частини - додатні числа',
                                content: 'a<b ; c<d ; ac<bd'
                            }
                        ]
                    },
                    {
                        type: 'p',
                        name: 'Віднімати і ділити почленно не можна',
                        content: 'a-b=a+(-b)<br>a/b=a*1/b'
                    }
                ]
            },
            {
                name: 'Нерівності з однією змінною',
                elements: [
                    {
                        type: 'p',
                        content: 'Для розв’язання нерівності з однією змінною, ми використовуємо числові проміжки, що включають в себе мінімальне та максимальне значення'
                    },
                    {
                        type: 'fornmula',
                        content:'x є (-безкінечності; +безкінечності)'
                    },
                    {
                        type: 'p',
                        content: 'Для розв’язання нерівності з однією змінною, ми використовуємо числові проміжки, що включають в себе мінімальне та максимальне значення'
                    },
                    {
                        type: 'p',
                        content: 'Якщо в проміжку наявні квадратні дужки, то значення біля них включено'
                    },
                    {
                        type: 'p',
                        content: 'Якщо в проміжку наявні круглі дужки, то значення біля них виключено'
                    }
                ]
            },
            {
                name: 'Системи лінійних нерівностей',
                elements: [
                    {
                        type: 'p',
                        content: 'Для розв’язання системи лінійних нерівностей, ми спершу розв’язуємо кожну з нерівностей в ній, а тоді за допомогою схематичного графіку знаходимо проміжок, що задовольняє кожну з них'
                    }
                ]
            },
            {
                name: 'Подвійні нерівності',
                elements: [
                    {
                        type: 'p',
                        content: 'Їх можна розв’язувати, як систему нерівностей, попередньо розділившицілу нерівність на дві менші'
                    }
                ]
            },
            {
                name: 'Лінійні нерівності',
                elements: [
                    {
                        type: 'p',
                        content: 'ax^2+bx+c, де a,b,c-деякі числа, a0, а права 0 називається квадратною нерівністю'
                    },
                    {
                        type: 'ol',
                        name: 'Для розв’язання квадратних нерівностей за допомогою графіків треба',
                        data: [
                            {
                                type: 'p',
                                content: 'Визначити напрям віток'
                            },
                            {
                                type: 'p',
                                content: 'Знайти нулі функції'
                            },
                            {
                                type: 'p',
                                content: 'Схематично побудувати параболу, використовуючи точку перетину з віссю x, якщо є'
                            },
                            {
                                type: 'p',
                                content: 'За графіком визначити проміжки, при яких виконується задана нерівність'
                            }
                        ]
                    }
                ]
            }
        ],
        'Проміжки та прогресії': [
            {
                name: 'Числові множини',
                elements: [
                    {
                        type: 'p',
                        content: 'N = {1, 2, 3…} - множина натуральних чисел'
                    },
                    {
                        type: 'p',
                        content: 'Z = {0; +-1; +-2; +-3…} - множина цілих чисел'
                    },
                    {
                        type: 'p',
                        content: 'Q - множина раціональних чисел (цілі і дробові; додатні і від’ємні)'
                    },
                    {
                        type: 'p',
                        content: 'Кожне раціональне число можна записати у вигляді нескінченного періодичного десяткового дробу 5,(0)'
                    },
                    {
                        type: 'p',
                        content: 'Ірраціональні числа - це числа, які є нескінченними, неперіодичними десятковими дробами'
                    },
                    {
                        type: 'p',
                        content: 'R - всі числа (множина дійсних чисел)'
                    }
                ]
            },
            {
                name: 'Числові послідовності',
                elements: [
                    {
                        type: 'p',
                        content: '1,2,3,4,5,... - послідовність натуральних чисел'
                    },
                    {
                        type: 'p',
                        content: '1,4,9,14,25,... - послідовність квадратів натуральних чисел'
                    },
                    {
                        type: 'p',
                        content: '1;1/2;1/3;1/4;1/5;... - послідовність обернених до натуральних чисел'
                    },
                    {
                        type: 'p',
                        content: 'a1,a2, ... ,an;'
                    },
                    {
                        type: 'p',
                        content: 'a1- перший член послідовності'
                    },
                    {
                        type: 'p',
                        content: 'an- n ий член послідовності'
                    },
                    {
                        type: 'np',
                        name: 'Послідовність часто задають за допомогою формули n-го члена',
                        content: 'an=n/(n+1)'
                    },
                    {
                        type: 'p',
                        content: 'Послідовність може бути надана за допомогою рекурентної формули - виражає член послідовності через попередні'
                    },
                    {
                        type: 'p',
                        content: 'Послідовності бувають скінченні, нескінченні, зростаючі, спадні та інші'
                    },
                    {
                        type: 'p',
                        content: 'Скінченна послідовністю - це послідовність, яка  має скінченне число членів, то її називають'
                    },
                    {
                        type: 'p',
                        content: 'Нескінченна послідовністю - це послідовність, яка  має нескінченне число членів, то її називають'
                    },
                    {
                        type: 'p',
                        content: 'Зростаюча послідовність - це послідовність, в якій кожен наступний елемент перевищує попередній'
                    },
                    {
                        type: 'p',
                        content: 'Спадна послідовність - це послідовність, в якій кожний член, починаючи з другого, менший від попереднього'
                    }
                ]
            },
            {
                name: 'Арифметична прогресія',
                elements: [
                    {
                        type: 'p',
                        content: 'Арифметична прогресія - це послідовність, до кожного наступного члена якої, починаючи від другого, додають певне число'
                    },
                    {
                        type: 'p',
                        content: '7;11;15;19;...'
                    },
                    {
                        type: 'p',
                        content: 'd - різниця арифметичної прогресії'
                    },
                    {
                        type: 'p',
                        content: 'an=a1+d*(n-1) - формула n-го члена'
                    },
                    {
                        type: 'np',
                        name: 'Властивість членів арифметичної прогресії',
                        content: 'Кожен член, починаючи з другого, є середнім арифметичним з двома сусідніми або рівновіддаленими від нього членами'
                    },
                    {
                        type: 'np',
                        name: 'Сума перших n членів арифметичної прогресії',
                        content: 'S=((a1+an)/2)*n=(2*a1+d(n-1))/2)*n'
                    }
                ]
            },
            {
                name: 'Геометрична прогресія',
                elements: [
                    {
                        type: 'p',
                        content: 'Геометрична прогресія - це послідовність, кожний член якої, починаючи з другого, дорівнює попередньому, домноженому на одне і те саме число, як називається знаменником геометричної прогресії'
                    },
                    {
                        type: 'p',
                        content: '4;12;36;108;...'
                    },
                    {
                        type: 'p',
                        content: 'q - знаменник геометричної прогресії'
                    },
                    {
                        type: 'p',
                        content: 'bn=b1*q^(n-1)- формула n-го члена'
                    },
                    {
                        type: 'np',
                        name: 'Властивість членів геометричної прогресії',
                        content: 'Квадрат кожного член, починаючи з другого, є добутком двох сусідніх або рівновіддаленими від нього членами'
                    },
                    {
                        type: 'np',
                        name: 'Сума членів геометричної прогресії',
                        content: 'Sn=(b1*(q^n-1))/(q-1)'
                    },
                    {
                        type: 'np',
                        name: 'Формула складних відсотків',
                        content: 'an=a0*(1+(p/100))^n'
                    },
                    {
                        type: 'p',
                        content: 'Прогресія називається нескінченно спадною, якщо |q|<1'
                    },
                    {
                        type: 'np',
                        name: 'Сума всіх членів',
                        content: 'S=b1/(1-q)-сума всіх членів'
                    }
                ]
            }
        ],
        'Функції': [
            {
                name: 'Функція',
                elements: [
                    {
                        type: 'p',
                        content: 'Функцією називається залежність змінної y від змінної x при якій кожному значенню x відповідає єдине значення y'
                    },
                    {
                        type: 'p',
                        content: 'x - незалежна змінна (аргумент)'
                    },
                    {
                        type: 'p',
                        content: 'y - залежна змінна (функція)'
                    },
                    {
                        type: 'p',
                        content: 'Усі значення, який набуває аргумент утворюють область визначень функції'
                    },
                    {
                        type: 'p',
                        content: 'Усі значення, яких набуває залежна змінна утворюють область значень функції'
                    },
                    {
                        type: 'p',
                        content: 'Нулі функції - це значення x, при яких функція набуває значення 0:f(x)=0'
                    },
                    {
                        type: 'p',
                        content: 'Функція називають зростаючою, якщо більшому значенню x відповідає більше значення y'
                    },
                    {
                        type: 'p',
                        content: 'Функція називається спадною, якщо більшому значенню x відповідає менше значення y'
                    },
                    {
                        type: 'p',
                        content: 'Проміжок знакосталості функції - це проміжок, на якому y набуває значення одного знаку, тобто y>0 або y<0'
                    },
                    {
                        type: 'p',
                        content: 'Для запису єдиного значення функції, використовуємо фігурні дужки {}'
                    },
                    {
                        type: 'ol',
                        name: 'Способи задання функції',
                        data: [
                            {
                                type: 'p',
                                content: 'Словесний'
                            },
                            {
                                type: 'p',
                                content: 'Формулою'
                            },
                            {
                                type: 'p',
                                content: 'Таблицею'
                            },
                            {
                                type: 'p',
                                content: 'Графіком'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Лінійна функція',
                elements: [
                    {
                        type: 'p',
                        content: 'функцію, яку можна задати формулою y=kx+b, де y k, b - деякі числа, x - аргумент, називають лінійною'
                    },
                    {
                        type: 'p',
                        content: 'Графіком лінійної функції є пряма'
                    },
                    {
                        type: 'p',
                        content: 'Щоб побудувати пряму достатньо мати 2-і точки'
                    }
                ]
            },
            {
                name: 'Пряма пропорційність',
                elements: [
                    {
                        type: 'p',
                        content: 'Лінійну функцію, яку задають формулою y=kx, де k0 називають прямою пропорційністю'
                    },
                    {
                        type: 'p',
                        content: 'Графік прямої пропорційності - це пряма, яка проходить через точку O(0;0)'
                    }
                ]
            },
            {
                name: 'y=k/x',
                elements: [
                    {
                        type: 'p',
                        content: 'Функцію, яку можна задати формулою y=k/x, де x - аргумент, k - будь-яке число, k0, називають оберненою пропорційністю'
                    },
                    {
                        type: 'p',
                        content: 'Графік оберненої пропорційності називається гіперболою'
                    },
                    {
                        type: 'p',
                        content: 'Гіпербола складається з двох віток'
                    },
                    {
                        type: 'p',
                        content: 'Якщо k>0, то гіпербола знаходиться в 1 і 3 чвертях'
                    },
                    {
                        type: 'p',
                        content: 'Якщо k<0, то гіпербола знаходиться в 2 і 4 чвертях'
                    }
                ]
            },
            {
                name: 'y=x^2',
                elements: [
                    {
                        type: 'p',
                        content: 'Графік функції y=x2 називається парабола'
                    },
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'p',
                                content: 'парабола має 2 нескінченні вітки, які плавно сходяться в одній точці - в вершині параболи'
                            },
                            {
                                type: 'p',
                                content: 'Графік симетричний відносно осі y'
                            },
                            {
                                type: 'p',
                                content: 'Область визначення - всі значення x'
                            },
                            {
                                type: 'p',
                                content: 'Область значення y>=0'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'y=x^(1/2)',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'p',
                                content: 'Графік функції y=x^(1/2) - одна вітка параболи, що виходить з початку координат і знаходиться в I чверті'
                            },
                            {
                                type: 'p',
                                content: 'Область визначень: x>=0'
                            },
                            {
                                type: 'p',
                                content: 'Область значень: y>=0'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Функція y=ax^2 та її властивості',
                elements: [
                    {
                        type: 'p',
                        content: 'Графік функції y=ax^2 можна отримати з графіка функції y=x^2, в результаті розтягнення в a разів від осі x, якщо a>1  і стиснення в a разів, якщо 0<a<1'
                    }
                ]
            },
            {
                name: 'Побудова y=f(x)+b та y=f(x+a)',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'p',
                                content: 'Графік функції y=f(x)+b можна отримати з графіка функції y=x2, за допомогою паралельного перенесення вздовж осі y, на b вгору, якщо b>0 і на b вниз, якщо b<0'
                            },
                            {
                                type: 'p',
                                content: 'Графік функції y=f(x+a) можна отримати з графіка функції y=x2, за допомогою паралельного перенесення вздовж осі x, на a одиниць вліво, якщо a>0 і на a одиниць вправо, якщо a<0'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Квадратична функція. Її графік і властивості',
                elements: [
                    {
                        type: 'p',
                        content: 'Функцію, яку можна задати формулою y=ax^2+bx+c, де x-аргумент; a,b,c-деякі числа, називається квадратичною'
                    },
                    {
                        type: 'p',
                        content: 'Графік квадратичної функції - це парабола, вершина якої знаходиться за формулою x0=b/2a'
                    },
                    {
                        type: 'p',
                        content: '(x0;y0)-вершина'
                    },
                    {
                        type: 'ol',
                        name: 'Побудова графіка квадратичної функції',
                        data: [
                            {
                                type: 'p',
                                content: 'Напрям віток a>0 вгору a<0 вниз'
                            },
                            {
                                type: 'p',
                                content: 'Вершина параболи x0=-b/2a ; y=f(x0)'
                            },
                            {
                                type: 'p',
                                content: 'Перетин з осями координат <br>Перетин з Ox: y=0 <br>Перетин з Oy: x=0'
                            },
                            {
                                type: 'p',
                                content: 'Таблиця'
                            },
                            {
                                type: 'p',
                                content: 'Побудова графіка'
                            }
                        ]
                    }
                ]
            }
        ],
        'Оператори': [
            {
                name: 'Степінь',
                elements: [
                    {
                        type: 'ul',
                        name: 'Натуральний показник',
                        data: [
                            {
                                type: 'p',
                                content: '3^4=3*3*3*3=81'
                            },
                            {
                                type: 'p',
                                content: '3 - основа степеня'
                            },
                            {
                                type: 'p',
                                content: '4 - показник степеня'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Цілий показник',
                        data: [
                            {
                                type: 'p',
                                content: 'a^(-n)=1/(a^n)'
                            },
                            {
                                type: 'p',
                                content: 'a^0=1, a!=0'
                            },
                            {
                                type: 'p',
                                content: '(a/b)^(-n)=(b/a)^n'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Властивості',
                        data: [
                            {
                                type: 'p',
                                content: 'a^n*a^m=a^(n+m)'
                            },
                            {
                                type: 'p',
                                content: 'a^n:a^m=a^(n-m)'
                            },
                            {
                                type: 'p',
                                content: '(a^n)^m=a^(n*m)'
                            },
                            {
                                type: 'p',
                                content: '(a*b)^n=a^n*b^n'
                            },
                            {
                                type: 'p',
                                content: '(a/b)^n=(a^n)/(b^n)'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Раціональні дроби',
                elements: [
                    {
                        type: 'p',
                        content: 'Раціональний дріб - це дріб, чисельник і знаменник якого - многочлени'
                    },
                    {
                        type: 'p',
                        content: 'Раціональні вирази - це вирази, що це містять квадратного кореня'
                    },
                    {
                        type: 'p',
                        content: 'Допустимі значення змінних - це всі значення, при яких вираз має зміст'
                    },
                    {
                        type: 'np',
                        name: 'Основна властивість дробу',
                        content: 'Якщо чисельник і знаменник раціонального дробу помножити і поділити на один і той самий вираз, то отримаємо дріб, який тотожно дорівнює даному'
                    },
                    {
                        type: 'p',
                        content: 'Щоб додати(відняти) дроби з однаковими знаменниками, треба додати(відняти) їх чисельники і залишити той самий знаменник'
                    }, 
                    {
                        type: 'p',
                        content: 'Щоб додати(відняти) дроби з різними знаменниками звести їх до спільного знаменника, а потім виконати додавання (віднімання) дробів з однаковими знаменниками'
                    }
                ]
            },
            {
                name: 'Множення раціональних дробів',
                elements: [
                    {
                        type: 'p',
                        content: 'Щоб помножити дріб на дріб, треба помножити чисельник на чисельник, а знаменник — на знаменник, і перший добуток записати в чисельнику, а другий — у знаменнику. Таким чином перемножуються кілька дробів. Якщо можливо, отриманий у результаті дріб скорочують'
                    },
                    {
                        type: 'p',
                        content: 'Для ділення раціональних дробів, ми перевертаємо другий дріб та заміняємо знак ділення на множення'
                    },
                    {
                        type: 'p',
                        content: 'Дробові рівняння: дріб дорівнює 0, якщо чисельник дорівнює 0, а знаменник не дорівнює нулю'
                    }
                ]
            },
            {
                name: 'Квадратний корінь',
                elements: [
                    {
                        type: 'p',
                        content: 'Квадратним коренем з числа a називається невід’ємне число, квадрат якого дорівнює a'
                    },
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'p',
                                content: '(a^2)^(1/2)=|a|'
                            },
                            {
                                type: 'p',
                                content: '(a*b)^(1/2)=a^(1/2)*b^(1/2)'
                            },
                            {
                                type: 'p',
                                content: '(a/b)^(1/2)=a^(1/2)/b^(1/2)'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'p',
                                content: 'Винесення множника з-під знаку кореня'
                            },
                            {
                                type: 'p',
                                content: 'Внесення множника під знак кореня'
                            },
                            {
                                type: 'p',
                                content: 'Звільнення від ірраціональності'
                            }
                        ]
                    }
                ]
            }
        ],
        'Одночлени та многочлени': [
            {
                name: 'Одночлен',
                elements: [
                    {
                        type: 'p',
                        content: 'Одночлен - це вираз, який є добутком чисел, змінних та їх степенів'
                    },
                    {
                        type: 'p',
                        content: '3x*y^2'
                    },
                    {
                        type: 'p',
                        content: 'Стандартний вигляд одночлена - це одночлен, який містить тільки один числовий множник (на першому місці) і степені різних змінних'
                    }
                ]
            },
            {
                name: 'Многочлен',
                elements: [
                    {
                        type: 'np',
                        name: 'Многочленом називається сума одночленів',
                        content: 'xy+5(x^2)y-3y^2'
                    },
                    {
                        type: 'p',
                        content: 'Подібні члени многочлена мають однакові буквенні вирази'
                    },
                    {
                        type: 'p',
                        content: 'Многочлен стандартного вигляду - це сума одночленів стандартного вигляду, серед яких немає подібних'
                    },
                    {
                        type: 'p',
                        content: 'Степінь многочлена - це найбільший із степенів одночленів, що входять до нього'
                    },
                    {
                        type: 'p',
                        content: 'Щоб помножити одночлен на многочлен потрібно помножити цей одночлен на кожний член многочлена і отримані добутки додати'
                    },
                    {
                        type: 'p',
                        content: 'Щоб помножити многочлен на многочлен, треба кожний член першого многочлена помножити на кожний член другого многочлена і отримані добутки додати'
                    }
                ]
            },
            {
                name: 'Розкладання многочлена на множники',
                elements: [
                    {
                        type: 'p',
                        content: 'Розкласти многочлен на множники означає надати даний многочлен у вигляді добутку кількох множників'
                    },
                    {
                        type: 'ol',
                        name: 'Є 3 способи розкладу многочлена на множники',
                        data: [
                            {
                                type: 'p',
                                content: 'Винесення спільного множника за дужки'
                            },
                            {
                                type: 'p',
                                content: 'Групування'
                            },
                            {
                                type: 'p',
                                content: 'Формули скороченого множення'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Спосіб групування',
                        data: [
                            {
                                type: 'p',
                                content: 'Цим способом користуються, якщо многочлен містить 4, 6 і так далі множників'
                            },
                            {
                                type: 'p',
                                content: 'Многочлен записують у вигляді пар доданків таким чином, щоб із кожної пари можна було винести один і той самий множник. Цей спільний множник можна винести за дужку'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Формули скороченого множення',
                        data: [
                            {
                                type: 'np',
                                name: 'Різниця квадратів дорівнює добутку різниці та суми цих виразів',
                                content: 'a^2-b^2=(a-b)*(a+b)'
                            },
                            {
                                type: 'np',
                                name: 'Квадрат суми дорівнює квадрат першого виразу додати подвоєний добуток цих виразів додати квадрат другого виразу',
                                content: '(a+b)^2=a^2+2ab+b^2'
                            },
                            {
                                type: 'np',
                                name: 'Квадрат різниці дорівнює квадрат першого виразу відняти подвоєний добуток цих виразів додати квадрат другого виразу',
                                content: '(a-b)^2= a^2-2ab+b^2'
                            },
                            {
                                type: 'np',
                                name: 'Сума кубів двох виразів  дорівнює добутку суми цих виразів і неповного квадрата їхньої різниці',
                                content: 'a^3+b^3=(a+b)*(a^2-ab+b^2)'
                            },
                            {
                                type: 'np',
                                name: 'Різниця кубів двох виразів дорівнює добутку різниці цих виразів і неповного квадрату їхньої суми',
                                content: 'a^3-b^3=(a-b)*(a^2+ab+b^2)'
                            }
                        ]
                    }
                ]
            }
        ],
        'Інше': [
            {
                name: 'Стандартний вигляд числа',
                elements: [
                    {
                        type: 'p',
                        content: 'Запис у вигляді a*10^n, де 1<=a<10, n є Z називається стандартним виглядом числа'
                    }
                ]
            },
            {
                name: 'Основні правила комбінаторики',
                elements: [
                    {
                        type: 'p',
                        content: 'Комбінаторика - це розділ математики, в якому вивчається питання про те, скільки різних комбінацій, утворених за певним правилом, можна скласти із заданих об’єктів'
                    },
                    {
                        type: 'p',
                        content: 'Більшість комбінаторних задач розв’язуються за правилом суми або правилом добутку'
                    },
                    {
                        type: 'p',
                        content: 'Правило суми: якщо елемент A може бути вибраний n способами, а елемент B - k способами, то вибір A або B може бути здійснений m+k способами'
                    },
                    {
                        type: 'p',
                        content: 'Правило добутку: якщо елемент A може бути вибраний n способами, а елемент B - k способами, то вибір A і B може бути здійснений mk способами'
                    }
                ]
            },
            {
                name: 'Класичне означення ймовірності',
                elements: [
                    {
                        type: 'p',
                        content: 'Теорія імовірності - це наука про випадковість подій'
                    },
                    {
                        type: 'p',
                        content: 'Випадкова подія може відбутися, а може і не відбутися'
                    },
                    {
                        type: 'p',
                        content: 'Події позначаємо великими буквами латинського алфавіту'
                    },
                    {
                        type: 'ul',
                        name: 'Події бувають',
                        data: [
                            {
                                type: 'p',
                                content: 'вірогідні (100% так)'
                            },
                            {
                                type: 'p',
                                content: 'неможливі (100% ні)'
                            }
                        ]
                    },
                    {
                        type: 'np',
                        name: 'Імовірністю випадкової подій A називають відношення n подій, що сприяють появі події A до загальних n подій',
                        content: 'P(A)=m/n'
                    }
                ]
            },
            {
                name: 'Статистика',
                elements: [
                    {
                        type: 'p',
                        content: 'Статистика - це наука про отримання, обробку і аналіз кількісних даних, які характеризують масові явища',
                    },
                    {
                        type: 'p',
                        content: 'Вибірка - це сукупність об’єктів, на основі яких проводять дослідження',
                    },
                    {
                        type: 'p',
                        content: 'Об’єм вибірки - це кількість елементів у вибірці',
                    },
                    {
                        type: 'p',
                        content: 'Мода(Mo) - це число, яке трапляється найчастіше',
                    },
                    {
                        type: 'p',
                        content: 'Медіана(Me) - це число, яке поділяє навпіл варіаційний ряд',
                    },
                    {
                        type: 'p',
                        content: 'Середнє значення - це середнє арифметичне всіх елементів у вибірці',
                    },
                    {
                        type: 'p',
                        content: 'Розмах вибірки - це різниця між крайніми членами варіаційного ряду',
                    },
                    {
                        type: 'ol',
                        name: 'Наочне подання статистичної інформації',
                        data: [
                            {
                                type: 'p',
                                content: 'Гістограма (стовпчаста діаграма)'
                            },
                            {
                                type: 'p',
                                content: 'Полігон частот (графік: Ox- варіант, Oy -частота)'
                            },
                            {
                                type: 'p',
                                content: 'Кругова діаграма'
                            }
                        ]
                    }
                ]
            }
        ]
    },

    geometry: {
        'Базові елементи': [
            {
                name: 'Геометрія. Точка і пряма. Властивості точок і прямих.',
                elements: [
                    {
                        type: 'p',
                        content: 'Планіметрія - це розділ геометрії, де вивчаються властивості фігур на площині'
                    },
                    {
                        type: 'p',
                        content: 'Промінь - це відрізок, що має початок і не має кінця'
                    },
                    {
                        type: 'p',
                        content: 'Доповняльні промені - це два промені, які мають спільний початок і лежать на одній прямій, доповнюючи один одного до прямої'
                    },
                    {
                        type: 'p',
                        content: 'Рівні відрізки - це відрізки, які можна сумістити накладанням'
                    },
                    {
                        type: 'p',
                        content: 'Основні фігури на площині - це точка і пряма'
                    },
                    {
                        type: 'np',
                        name: 'Основна властивість прямої',
                        content: 'Через будь-які дві точки можна провести пряму і до того ж тільки одну'
                    },
                    {
                        type: 'np',
                        name: 'Основна властивість довжини відрізка',
                        content: 'Кожний відрізок має певну довжину, більшу від 0. Довжина відрізка дорівнює сумі довжин частин, на які він розбитий будь-якою точкою'
                    },
                ]
            },
            {
                name: 'Кут. Вимірювання кутів',
                elements: [
                    {
                        type: 'p',
                        content: 'Кут - це геометрична фігура, яка складається з двох променів, які виходять з однієї точки'
                    },
                    {
                        type: 'p',
                        content: 'Розгорнутий кут - це кут сторони якого є доповняльними променями.'
                    },
                    {
                        type: 'p',
                        content: 'Бісектриса кута - це промінь, який виходить з вершини кута і ділить цей кут на 2 рівних кути'
                    },
                    {
                        type: 'p',
                        content: 'Суміжні кути - це кути, в яких одна сторона в них спільна, а дві інші сторони цих кутів є доповняльними променями'
                    },
                    {
                        type: 'p',
                        content: 'Вертикальні кути - це кути, в яких обидві сторони одного кута є продовженням сторін другого.'
                    },
                    {
                        type: 'np',
                        name: 'Основна властивість вимірювання кутів.',
                        content: 'Кожний кут має градусну міру більшу від нуля. Розгорнутий кут = 180°'
                    },
                    {
                        type: 'p',
                        content: 'Градусна міра кута дорівнює сумі градусних мір кутів на які він розбивається будь-яким променем, що проходить між його сторонами.'
                    },
                    {
                        type: 't',
                        name: 'Теорема (про суміжні кути)',
                        content: 'Сума сусідніх кутів = 180°'
                    }
                ]
            },
            {
                name: 'Перпендикулярні прямі',
                elements: [
                    {
                        type: 'p',
                        content: 'Перпендикулярні прямі - це прямі, що перетинаються під прямим кутом'
                    },
                    {
                        type: 'p',
                        content: 'Перпендикулярні відрізки - це відрізки, що лежать на перпендикулярних прямих'
                    }
                ]
            },
            {
                name: 'Паралельні прямі, ознака паралельності прямих',
                elements: [
                    {
                        type: 'p',
                        content: 'Паралельні прямі - це прямі, що не перетинаються і лежать в одній площині'   
                    },
                    {
                        type: 'p',
                        content: 'Внутрішні різносторонні кути - це кути, які лежать з різних боків від січної с між прямими а і b'
                    },
                    {
                        type: 'p',
                        content: 'Внутрішні односторонні кути - кути, які лежать з одного боку від січної с між прямими а і b'
                    },
                    {
                        type: 'p',
                        content: 'Відповідні кути - це два кути, які знаходяться в «одному місці» щодо поперечного, але на різних лініях'
                    },
                    {
                        type: 'np',
                        name: 'Аксіома (паралельності прямих)',
                        content: 'Через точку, яка не лежить на даній прямій проходить тільки одна пряма, паралельна даній'
                    },
                    {
                        type: 'ol',
                        name: 'Теорема (ознака паралельності прямих)',
                        data: [
                            {
                                type: 'p',
                                content: 'Якщо внутрішні різносторонні кути, утворені при перетині двох прямих січною, рівні, то прямі паралельні'
                            },
                            {
                                type: 'p',
                                content: 'Якщо сума внутрішніх односторонніх кутів = 180°, то такі прямі паралельні'
                            },
                            {
                                type: 'p',
                                content: 'Якщо відповідні кути рівні, то прямі паралельні'
                            }
                        ]
                    }
                ]
            }
        ],
        'Коло, круг': [
            {
                name: 'Коло, круг',
                elements: [
                    {
                        type: 'p',
                        content: 'Відрізок, який сполучає точку на колі з його центром називається радіусом (R)'
                    },
                    {
                        type: 'p',
                        content: 'Відрізок, який сполучає дві точки кола називається хордою'
                    },
                    {
                        type: 'p',
                        content: 'Хорда, яка проходить через центр кола називаються діаметром (D)'
                    },
                    {
                        type: 'p',
                        content: 'Пряма, яка має з колом тільки одну спільну точку називається дотичною до кола'
                    },
                    {
                        type: 't',
                        name: 'Теорема (властивість дотичної)',
                        content: 'Дотична до кола перпендикулярна до радіуса, який проведений в точку дотику'
                    },
                    {
                        type: 'np',
                        name: 'Властивість діаметра',
                        content: 'Діаметр кола, який перпендикулярний до хорди ділить цю хорду навпіл'
                    },
                    {
                        type: 'np',
                        name: 'Властивість дотичних',
                        content: 'Якщо через одну точку до кола проведено дві дотичні, то відназки, які сполучають дану точку з точками дотику рівні'
                    }
                ]
            },
            {
                name: 'Взаємне розміщення двох кіл',
                elements: [
                    {
                        type: 'ol',
                        data: [
                            {
                                type: 'ul',
                                name: 'Два кола не перетинаються (є три випадки)',
                                data: [
                                    {
                                        type: 'p',
                                        content: 'Одне коло розміщене поза іншим O1O2 > R1+R2'
                                    },
                                    {
                                        type: 'p',
                                        content: 'Одне коло розміщене в іншому O1O2 < R1-R2'
                                    },
                                    {
                                        type: 'p',
                                        content: 'Центри співпадають - концентричні кола'
                                    }
                                ]
                            },
                            {
                                type: 'ul',
                                name: 'Кола перетинаються - O1O2 < R1+R2',
                                data: [
                                    {
                                        type: 'p',
                                        content: 'Зовнішній дотик (спільна дотична і кола знаходяться по різні боки від неї)'
                                    },
                                    {
                                        type: 'p',
                                        content: 'Внутрішній дотик (спільна дотична і кола знаходяться по один бік від неї)'
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Центральні і вписані кути',
                elements: [
                    {
                        type: 'p',
                        content: 'Центральний кут -це кут з вершиною в центрі кола'
                    },
                    {
                        type: 'p',
                        content: 'Вписаний кут - це кут, вершина якого лежить на колі, а сторони перетинають коло'
                    },
                    {
                        type: 't',
                        name: 'Теорема (про вписаний кут)',
                        content: 'Вписаний кут = половину дуги, на яку він спирається',
                        cons: [
                            {
                                type: 'p',
                                content: 'Вписані кути, які спираються на одну і ту саму дугу - рівні'
                            },
                            {
                                type: 'p',
                                content: 'Вписаний кут, який спирається на діаметр (півколо) - прямий'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Довжина кола. Площа круга',
                elements: [
                    {
                        type: 'p', 
                        content: 'l=2пR'
                    },
                    {
                        type: 'p', 
                        content: 'S=пR^2'
                    }
                ]
            },
            {
                name: 'Довжина дуги кола. Площа сектора',
                elements: [
                    {
                        type: 'p', 
                        content: 'l=(2пR)/(360°) - довжина дуги 1°'
                    },
                    {
                        type: 'p', 
                        content: 'l=(2пRа)/(360°)=(пRа)/(180°) - довжина дуги а'
                    },
                    {
                        type: 'p', 
                        content: 'S=(пR^2)/(360°) - площа сектора 1°'
                    },
                    {
                        type: 'p', 
                        content: 'S=(пR^2a)/(360°) - площа сектора a'
                    }
                ]
            },
            {
                name: 'Площа сегмента',
                elements: [
                    {
                        type: 'p', 
                        content: 'Sсегмента=Sсектора-Sтрикутника, при  < 180°'
                    },
                    {
                        type: 'p', 
                        content: 'Sсегмента=Sсектора+Sтрикутника, при  > 180°'
                    },
                ]
            },
        ],
        'Трикутники': [
            {
                name: 'Трикутник',
                elements: [
                    {
                        type: 'p',
                        content: 'Трикутником називається геометрична фігура, що складається з трьох точок (вершин трикутника), які не лежать на одній прямій, і трьох відрізків (сторін трикутника), що попарно сполучають ці точки'
                    },
                    {
                        type: 't',
                        name: 'Теорема (про суму кутів трикутника)',
                        content: 'Сума кутів трикутника дорівнює 180°'
                    },
                    {
                        type: 'ol',
                        name: 'Види трикутників за кутами',
                        data: [
                            {
                                type: 'p',
                                content: 'гострі (всі кути гострі)'
                            },
                            {
                                type: 'p',
                                content: 'прямокутні (один кут прямий, а 2 інші - гострі)'
                            },
                            {
                                type: 'p',
                                content: 'тупокутні (один кут тупий, а 2 інші - гострі)'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Щоб встановити вид трикутника, якщо відомо сторони a, b, c, c - найбільша сторона',
                        data: [
                            'с2> a2+b2 - тупокутній', 
                            'с2= a2+b2 - прямокутний', 
                            'с2< a2+b2 - гострокутній'
                        ]
                    }
                ]
            },
            {
                name: 'Додаткові елементи',
                elements: [
                    {
                        type: 'p',
                        content: 'Висота - це перпендикуляр, опущений з вершини трикутника на пряму, яка містить протилежну сторону'
                    },
                    {
                        type: 'p',
                        content: 'Медіана - це відрізок, який сполучає вершину трикутника з серединою протилежної сторони'
                    },
                    {
                        type: 'p',
                        content: 'Бісектриса - це відрізок, який виходить з вершини трикутника і ділить кут навпіл'
                    },
                    {
                        type: 'p',
                        content: 'Середня лінія - це відрізок, який сполучає середини двох його сторін'
                    },
                    {
                        type: 'p',
                        content: 'Зовнішній кут трикутника - це кут, суміжний з кутом цього трикутника'
                    },
                    {
                        type: 't',
                        name: 'Теорема(властивість середньої лінії трикутника)',
                        content: 'Середня лінія трикутника, яка сполучає середини двох його сторін паралельна третій стороні і дорівнює її половині',
                    },

                    {
                        type: 't',
                        name: 'Теорема(про зовнішній кут трикутника)',
                        content: 'Зовнішній кут трикутника = сумі двох кутів трикутника, несуміжних з ним',
                    },

                    {
                        type: 't',
                        name: 'Теорема(про сторони і кути трикутника)',
                        content: 'У трикутнику навпроти найбільшої сторони лежить найбільший кут',
                    }
                ]
            },
            {
                name: 'Рівні трикутники',
                elements: [
                    {
                        type: 'p',
                        content: 'Рівні трикутника - це трикутника, в яких всі сторони і кути рівні'
                    },
                    {
                        type: 'ol',
                        name: 'Ознаки рівності трикутників',
                        data: [
                            {
                                type: 'p',
                                content: 'Якщо 2 сторони і кут між ними одного трикутника = відповідно двом сторонам і куту між ними 2-го трикутника, то такі трикутники рівні'
                            },
                            {
                                type: 'p',
                                content: 'Якщо сторона і 2 прилеглі до неї кути одного трикутника відповідно дорівнюють стороні і 2-м прилеглим до неї кутам 2-го трикутника, то такі трикутники рівні'
                            },
                            {
                                type: 'p',
                                content: 'Якщо 3 сторони одного трикутника відповідно = 3-м сторонам іншого трикутника, то такі трикутники рівні'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Подібні трикутники',
                elements: [
                    {
                        type: 'p',
                        content: 'Подібна трикутника - це трикутника, в яких кути відповідно рівні, а сторони одного трикутника пропорційні відповідним сторонам другого трикутника'
                    },
                    {
                        type: 'np',
                        name: 'Лема(про подібні трикутники)',
                        content: 'Пряма, яка паралельна стороні даного трикутника відтинає його подібний'
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки подібності трикутників',
                        data: [
                            {
                                type: 'np',
                                name: 'Ознака подібності трикутників за двома кутами',
                                content: 'Якщо два кути одного трикутника дорівнюють двом кутам другого трикутника, то такі трикутники подібні'
                            },
                            {
                                type: 'np',
                                name: 'Ознака подібності трикутника за двома сторонами і кутом між ними',
                                content: 'Якщо дві сторони одного трикутника пропорційні двом сторонам другого трикутника, а кути, утворені цими сторонами рівні, то такі трикутники подібні'
                            },
                            {
                                type: 'np',
                                name: 'Ознака подібності трикутників за трьома сторонами',
                                content: 'Якщо три сторони одного трикутника пропорційні трьом сторонам другого трикутника, то такі трикутники подібні'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Рівнобедрений трикутник',
                elements: [
                    {
                        type: 'p',
                        content: 'Рівнобедрений трикутник — трикутник, у якого дві рівні сторони'
                    },
                    {
                        type: 'p',
                        content: 'Рівносторонній трикутник — трикутник, у якого всі сторони рівні'
                    },
                    {
                        type: 't',
                        name: 'про кути рівнобедреного трикутника',
                        content: 'У рівнобедреному трикутнику кути при основі рівні',
                        cons: 'У рівностороннього трикутника всі кути рівні'
                    },
                    {
                        type: 't',
                        name: 'про бісектрису рівнобедреного трикутника',
                        content: 'У рівнобедреному трикутнику бісектриса, проведена до основи є медіаною і висотою'
                    },
                    {
                        type: 'ol',
                        name: 'Ознаки рівнобедреного трикутника',
                        data: [
                            {
                                type: 'p',
                                content: 'Якщо медіана трикутника є його висотою, то цей трикутник рівнобедрений'
                            },
                            {
                                type: 'p',
                                content: 'Якщо бісектриса трикутника є його висотою, то цей трикутник рівнобедрений'
                            },
                            {
                                type: 'p',
                                content: 'Якщо медіана трикутника є його бісектрисою, то цей трикутник рівнобедрений'
                            },
                            {
                                type: 'p',
                                content: 'Якщо в трикутнику 2 кути рівні, то цей трикутник рівнобедрений'
                            },
                            {
                                type: 'p',
                                content: 'Якщо в трикутнику всі кути рівні, то цей трикутник рівносторонній'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Прямокутний трикутник',
                elements: [
                    {
                        type: 'p',
                        content: 'Прямокутним трикутником називають трикутник, один із кутів якого прямий'
                    },
                    {
                        type: 'p',
                        content: 'Катет — сторона прямокутного трикутника, прилегла до прямого кута'
                    },
                    {
                        type: 'p',
                        content: 'Гіпотенуза — сторона прямокутного трикутника, яка лежить навпроти прямого кута'
                    },
                    {
                        type: 'p',
                        content: 'Розв’язати прямокутний трикутник означає знайти невідомі сторони і кути (всього 5: 2-відомі; 3-невідомі)'
                    },
                    {
                        type: 'ol',
                        name: 'Ознаки рівностей прямокутних трикутників',
                        data: [
                            {
                                type: 'p',
                                content: 'Якщо гіпотенуза та катети одного прямокутного трикутника відповідно дорівнюють гіпотенузі та катетам другого прямокутного трикутника, то такі трикутника рівні'
                            },
                            {
                                type: 'p',
                                content: 'За двома катетами'
                            },
                            {
                                type: 'p',
                                content: 'За катетом і прилеглим гострим кутом'
                            },
                            {
                                type: 'p',
                                content: 'За катетом і протилежним гострим кутом'
                            },
                            {
                                type: 'p',
                                content: 'За гіпотенузою і гострим кутом'
                            }
                        ]
                    },
                    {
                        type: 'ol',
                        name: 'Властивості прямокутних трикутників',
                        data: [
                            {
                                type: 'p',
                                content: 'У прямокутному трикутнику гіпотенуза більша за катет'
                            },
                            {
                                type: 'p',
                                content: 'Перпендикуляр завжди менший від похилої'
                            },
                            {
                                type: 'p',
                                content: 'Катет, який лежить навпроти кута 30° дорівнює половині гіпотенузи'
                            },
                            {
                                type: 'p',
                                content: 'Якщо в прямокутному трикутнику катет дорівнює половині гіпотенузи, то кут, який лежить навпроти цього катета дорівнює 30°'
                            }
                        ]
                    }
                ],
            },
            {
                name: 'Метричні співвідношення в прямокутному трикутнику',
                elements: [
                    {
                        type: 'p',
                        content: 'Висота прямокутного трикутника, проведена до гіпотенузи ділить трикутник на 2 подібних прямокутних трикутника, кожен з яких подібний даному'
                    },
                    {
                        type: 'p',
                        content: 'Квадрат висоти прямокутного трикутника, проведеної до гіпотенузи дорівнює добутку проекцій катетів на гіпотенузу'
                    },
                    {
                        type: 'p',
                        content: 'Квадрат катета дорівнює добутку гіпотенузи та проекції цього катета на гіпотенузу'
                    }
                ]
            },
            {
                name: 'Коло, вписане в трикутник',
                elements: [
                    {
                        type: 'p',
                        content: 'Коло називається вписаним у трикутник, якщо воно дотикається до всіх його сторін'
                    },
                    {
                        type: 'p',
                        content: 'У будь-який трикутник можна вписати коло'
                    },
                    {
                        type: 'p',
                        content: 'Центр кола, вписаного в трикутник - це точка перетину бісектрис'
                    },
                    {
                        type: 'p',
                        content: 'r=2S/(a+b+c), де r - радіус кола вписаного кола, S - площа трикутника'
                    }
                ]
            },
            {
                name: 'Коло, описане навколо трикутника',
                elements: [
                    {
                        type: 'p',
                        content: 'Коло називається описаним навколо трикутника, якщо воно проходить через усі його вершини'
                    },
                    {
                        type: 'p',
                        content: 'Навколо будь-якого трикутника можна описати коло'
                    },
                    {
                        type: 'p',
                        content: 'Центр кола, описаного навколо трикутника - це точка перетину серединних перпендикулярів до сторін трикутника'
                    },
                    {
                        type: 'p',
                        content: 'Центр кола, описаного навколо прямокутного трикутника лежить на середині гіпотенузи'
                    },
                    {
                        type: 'p',
                        content: 'Центр кола, описаного навколо тупокутного трикутника лежить поза трикутником'
                    },
                    {
                        type: 'p',
                        content: 'R=abc/4S, де R - радіус описаного кола, S - площа трикутника' 
                    }
                ],
            },
            {
                name: 'Площа трикутника',
                elements: [
                    {
                        type: 'ul',
                        name: 'Загальні',
                        data: [
                            {
                                type: 'p',
                                content: 'S=(1/2)ah'
                            },
                            {
                                type: 'p',
                                content: 'S=(1/2)absinа де -кут між a і b'
                            },
                            {
                                type: 'p',
                                content: 'S=(p(p-a)(p-b)(p-c))^(1/2), де p-половина периметра'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Спеціальні',
                        data: [
                            {
                                type: 'p',
                                content: 'S=(1/2)ab'
                            },
                            {
                                type: 'p',
                                content: 'S=(a^2)*((3)^(1/2))/4'
                            }
                        ]
                    }
                ]
            }
        ],
        'Чотирикутники': [
            {
                name: 'Чотирикутник та його елементи',
                elements: [
                    {
                        type: 'p',
                        content: 'Чотирикутником називається фігура, яка складається з чотирьох точок і чотирьох відрізків, що послідовно їх сполучають. При цьому жодні три з даних точок не повинні лежати на одній прямій, а відрізки, що їх сполучають, не повинні перетинатися.'
                    },
                    {
                        type: 'p',
                        content: 'Вершини чотирикутника - це точки.'
                    },
                    {
                        type: 'p',
                        content: 'Сторони чотирикутника - це відрізки, що сполучають точки.'
                    },
                    {
                        type: 'p',
                        content: 'Діагоналі - це відрізки, що сполучають протилежні вершини чотирикутника.'
                    },
                    {
                        type: 't',
                        name: 'Теорема(про суму кутів чотирикутника)',
                        content: 'Сума кутів чотирикутника = 360°'
                    },
                    {
                        type: 'ol',
                        name: 'Чотирикутники бувають',
                        data: [
                            {
                                type: 'p',
                                content: 'Опуклі (всі кути < 180°)'
                            },
                            {
                                type: 'p',
                                content: 'Неопуклі (один кут > 180°)'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Паралелограм',
                elements: [
                    {
                        type: 'p',
                        content: 'Паралелограмом називається чотирикутник, у якого протилежні сторони паралельні.'
                    },
                    {
                        type: 'p',
                        content: 'Висота паралелограма - це відрізок, проведений з вершини під кутом 90° до протилежної сторони.'
                    },
                    {
                        type: 't',
                        name: 'про протилежні сторони паралелограма',
                        content: 'Протилежні сторони паралелограма рівні (AB = CD, BC = AD)'
                    },
                    {
                        type: 't',
                        name: 'про протилежні кути паралелограма',
                        content: 'Протилежні кути паралелограма рівні (∠A=∠C, ∠B=∠D)'
                    },
                    {
                        type: 't',
                        name: 'про діагоналі паралелограма',
                        content: 'Діагоналі паралелограма точкою перетину діляться навпіл (AO=OC, BO=OD)'
                    },
                    {
                        type: 'np',
                        name: 'Властивість сусідніх кутів паралелограма',
                        content: 'Сума будь-яких двох сусідніх кутів паралелограма = 180°'
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки паралелограма',
                        data: [
                            {
                                type: 'p',
                                content: 'Якщо в чотирикутнику протилежні сторони паралельні, то цей чотирикутник - паралелограм'
                            },
                            {
                                type: 'p',
                                content: 'Якщо в чотирикутнику дві протилежні сторони паралельні і рівні, то цей чотирикутник - паралелограм'
                            },
                            {
                                type: 'p',
                                content: 'Якщо в чотирикутнику діагоналі точкою перетину діляться навпіл, то цей чотирикутник - паралелограм'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Прямокутник',
                elements: [
                    {
                        type: 'p',
                        name: 'Прямокутник - це паралелограм у якого всі кути прямі'
                    },
                    {
                        type: 't',
                        name: 'Прямокутник - це паралелограм у якого всі кути прямі',
                        content: 'Діагоналі прямокутники рівні'
                    },
                    {
                        type: 'np',
                        name: 'Ознакa прямокутника',
                        content: 'Якщо діагоналі паралелограма рівні, то цей паралелограм - прямокутник'
                    }
                ]
            },
            {
                name: 'Ромб',
                elements:[
                    {
                        type: 'p',
                        content: 'Ромб - це паралелограм, у якого всі сторони рівні'
                    },
                    {
                        type: 't',
                        name: 'про діагоналі ромба',
                        content: 'Діагоналі ромба перетинаються під прямим кутом і є бісектрисами його кутів'
                    },
                    {
                        type: 'ul',
                        name: 'Ознаки ромба',
                        data: [
                            {
                                type: 'p',
                                content: 'Якщо діагоналі паралелограма перпендикулярні, то цей паралелограм - ромб'
                            },
                            {
                                type: 'p',
                                content: 'Якщо діагоналі паралелограма є бісектрисами його кутів, то цей паралелограм - ромб'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Квадрат',
                elements: [
                    {
                        type: 'p',
                        content: 'Квадрат - це прямокутник, у якого всі сторони рівні'
                    }
                ]
            },
            {
                name: 'Трапеція',
                elements: [
                    {
                        type: 'p',
                        content: 'Трапецією називається чотирикутник, у якого тільки 2 сторони паралельні'
                    },
                    {
                        type: 'p',
                        content: 'Середньою лінією трапеції називається відрізок, який сполучає середини бічних сторін'
                    },
                    {
                        type: 'p',
                        content: 'Прямокутна трапеція - це трапеція, у якої два сусідніх кути дорівнюють 90°'
                    },
                    {
                        type: 'p',
                        content: 'Рівнобічна трапеція - це трапеція, в якої бічні сторони рівні'
                    },
                    {
                        type: 'p',
                        content: 'У рівнобічній трапеції кути при основі рівні'
                    },
                    {
                        type: 't',
                        name: 'про середню лінію трапеції',
                        content: 'Середня лінія трапеція паралельна основам і дорівнює їх півсумі'
                    }
                ]
            },
            {
                name: 'Вписані і описані чотирикутники',
                elements: [
                    {
                        type: 'p',
                        content: 'Коло називається описаним навколо чотирикутника, якщо воно проходить через всі його вершини',
                    },
                    {
                        type: 'p',
                        content: 'Коло називається вписаним в чотирикутник, якщо воно дотикається до всіх його сторін'
                    },
                    {
                        type: 't',
                        name: 'Теорема(про вписаний чотирикутник)',
                        content: 'Навколо чотирикутника можна описати коло, якщо сума його протилежних кутів = 180°'
                    },
                    {
                        type: 't',
                        name: 'Теорема(про описаний чотирикутник)',
                        content: 'У чотирикутник можна вписати коло, якщо суми його протилежних сторін - рівні'
                    }
                ]
            },
            {
                name: 'Площі',
                elements: [
                    {
                        type: 'ul',
                        name: 'Довільного чотирикутника',
                        data: [
                            {
                                type: 'p',
                                content: 'S=(1/2)*d1*d2*sina, де a-кут між діагоналями'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Паралелограма (можна використати для всіх інших, крім трапеції)',
                        data: [
                            {
                                type: 'p',
                                content: 'S=ah, де a-сторона паралелограма, h-висота, проведена до a'
                            },
                            {
                                type: 'p',
                                content: 'S=absinа, де a,b-сторони паралелограма, а-кут між ними'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Прямокутника',
                        data: [
                            {
                                type: 'p',
                                content: 'S=ab, де a,b-сторони прямокутника'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Квадрата',
                        data: [
                            {
                                type: 'p',
                                content: 'S=a^2, де a-сторони квадрата'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Ромба',
                        data: [
                            {
                                type: 'p',
                                content: 'S=(1/2)*d1*d2, де d1,d2-діагоналі'
                            }
                        ]
                    },
                    {
                        type: 'ul',
                        name: 'Трапеції',
                        data: [
                            {
                                type: 'p',
                                content: 'S=((a+b)/2)*h, де a, b-основи трапеції, h-висота'
                            }
                        ]
                    }
                ]
            }
        ],
        'Многокутники': [
            {
                name: 'Многокутники',
                elements: [
                    {
                        type: 'p',
                        content: 'Сума кутів n-кутника = 180°(n-2)'
                    },
                    {
                        type: 'p',
                        content: 'Сума всіх зовнішніх кутів будь-якого n-кутника = 360°'
                    }
                ]
            },
            {
                name: 'Правильні многокутники та їх властивості',
                elements: [
                    {
                        type: 'p',
                        content: 'Правильний многокутник - це многокутник, у якого всі сторони і всі кути рівні'
                    },
                    {
                        type: 'p',
                        content: 'В правильний многокутник завжди можна вписати коло і описати коло навколо нього, і центри цих кіл співпадатимуть (точка - центр многокутника)'
                    },
                    {
                        type: 'p',
                        content: 'Кут, під яким видно стороку правильного многокутника з його центру називають центральним кутом многокутника. Сума всіх центральних кутів=360°'
                    }
                ]
            },
            {
                name: 'Формули радіусів вписаних і описаних кіл правильних многокутників',
                elements: [
                    {
                        type: 'p',
                        content: 'R=a/(2*sin(180°/n))'
                    },
                    {
                        type: 'p',
                        content: 'r=a/(2*tg(180°/n))'
                    },
                    {
                        type: 'p',
                        content: 'r=(1/2)R в правильних многокутниках'
                    },
                    {
                        type: 'i',
                        src: '',
                        alt: 'oh no! you got me... not ready with this image yet :('
                    }
                ]
            }
        ],
        'Тригонометрія': [
            {
                name: 'Тригонометричні функції гострого кута прямокутного трикутника',
                elements: [
                    {
                        type: 'p',
                        content: 'Синусом(sin) гострого кута прямокутного трикутника називається відношення протилежного катета до гіпотенузи'
                    },
                    {
                        type: 'p',
                        content: 'Косинусом(cos) гострого кута прямокутного трикутника називається відношення прилеглого катета до гіпотенузи'
                    },
                    {
                        type: 'p',
                        content: 'Тангенсом(tg) гострого кута прямокутного трикутника називається відношення протилежного катета до прилеглого катета'
                    },
                    {
                        type: 'p',
                        content: 'Котангенсом(ctg) гострого кута прямокутного трикутника називається відношення прилеглого катета до протилежного катета'
                    },
                    {
                        type: 'i',
                        src: '',
                        alt: 'oh no! you got me... not ready with this image yet :('
                    }
                ]
            },
            {
                name: 'Тригонометричні формули',
                elements: [
                    {
                        type: 'p',
                        name: 'Основна тригонометрична тотожність',
                        content: 'sin^2(a) + cos^2(a) = 1'
                    },
                    {
                        type: 'p',
                        content: 'tga =sina/cosa'
                    },
                    {
                        type: 'p',
                        content: 'ctg(a) =cos(a)/sin(a)'
                    },
                    {
                        type: 'p',
                        content: 'tg(a)*ctg(a) = 1'
                    },
                    {
                        type: 'ol',
                        name: 'Формули зведення',
                        data: [
                            {
                                type: 'p',
                                content: 'sin(90°-a) = cos(a)'
                            },
                            {
                                type: 'p',
                                content: 'cos(90°-a) = sin(a)'
                            },
                            {
                                type: 'p',
                                content: 'tg(90°-a) = ctg(a)'
                            },
                            {
                                type: 'p',
                                content: 'ctg(90°-a) = tg(a)'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Синуси, косинуси, тангенси кутів від 0° до 180°',
                elements: [
                    {
                        type: 'i',
                        src: '',
                        alt: 'oh no! you got me... not ready with this image yet :('
                    },
                    {
                        type: 'ul',
                        name: 'cos, tg, ctg тупого кута є число від’ємне, а sin тупого кута - додатнє',
                        data: [
                            {
                                type: 'p',
                                content: 'sin(180°-a)=sin(a)'
                            },
                            {
                                type: 'p',
                                content: 'cos(180°-a)=-cos(a)'
                            },
                            {
                                type: 'p',
                                content: 'tg(180°-a)=-tg(a)'
                            },
                            {
                                type: 'p',
                                content: 'ctg(180°-a)=-ctg(a)'
                            }
                        ]
                    }
                ]
            }
        ],
        'Теореми': [
            {
                name: 'Теорема Піфагора',
                elements: [
                    {
                        type: 't',
                        name: 'Теорема (Піфагора)',
                        content: 'У прямокутному трикутнику квадрат гіпотенузи дорівнює сумі квадратів катетів'
                    }
                ]
            },
            {
                name: 'Теорема косинусів',
                elements: [
                    {
                        type: 't',
                        name: 'Теорема (косинусів)',
                        content: 'Квадрат сторони трикутника дорівнює сумі квадратів  двох інших сторін мінус подвоєний добуток цих сторін та косинус кута між ними',
                        cons: 'Сума квадратів всіх сторін паралелограма дорівнює сумі квадратів його діагоналей'
                    }
                ]
            },
            {
                name: 'Теорема синусів',
                elements: [
                    {
                        type: 't',
                        name: 'Теорема(синусів)',
                        content: 'Сторони трикутника відносяться до синусів протилежних кутів',
                        cons: 'Відношення сторін до синусів кутів, що лежать проти них, дорівнює подвоєному радіусу кола, описаного навколо цього трикутника'
                    }
                ]
            },
            {
                name: 'Теорема Фалеса і теорема про пропорційні відрізки',
                elements: [
                    {
                        type: 't',
                        name: 'Теорема Фалеса',
                        content: 'Якщо паралельні прямі, які перетинають сторони кута відтинають на одній його стороні рівні відрізки, то вони відтинають рівні відрізки і на другій стороні кута'
                    },
                    {
                        type: 't',
                        name: 'Теорема (про пропорційні відрізки)',
                        content: 'Паралельні прямі, які перетинають сторони кута, відтинають від сторін кута пропорційні відрізки'
                    },
                    {
                        type: 'np',
                        name: 'Властивість медіан трикутника',
                        content: 'Усі три медіани трикутника перетинаються в одній точці і точкою перетину діляться у відношенні 2:1 починаючи від вершини трикутника'
                    },
                    {
                        type: 'np',
                        name: 'Властивість бісектриси трикутника',
                        content: 'Бісектриса трикутника ділить його сторону на відрізки пропорційні прилеглим до них сторонам'
                    }
                ]
            }
        ],
        'Вектори': [
            {
                name: 'Вектори',
                elements: [
                    {
                        type: 'p',
                        content: 'Вектором називається напрямлений відрізок'
                    },
                    {
                        type: 'p',
                        content: 'Вектори бувають однонапрямлені, або протилежнонапрямлені'
                    },
                    {
                        type: 'p',
                        content: 'Модулем(абсолютною величиною вектора) називається довжина відрізка, який зображує вектор'
                    },
                    {
                        type: 'p',
                        content: 'Нульовий вектор - це вектор, в якого початок збігається з кінцем'
                    },
                    {
                        type: 'p',
                        content: 'Два вектори називаються рівними, якщо вони однаково напрямлені та рівні за абсолютною величиною'
                    },
                    {
                        type: 'p',
                        content: 'Вектори називаються колінеарними, якщо вони лежать на || прямих, або на одній прямій'
                    }
                ]
            },
            {
                name: 'Координати вектора',
                elements: [
                    {
                        type: 'p',
                        content: 'A(x1;y1);  B(x2;y2)<br>AB(x2-x1;y2-y1)<br>a(x;y)<br>a=(x^2+y^2)(1/2)'
                    },
                    {
                        type: 'p',
                        content: 'Рівні вектори мають однакові координати'
                    }
                ]
            },
            {
                name: 'Додавання векторів',
                elements: [
                    {
                        type: 'np',
                        name: 'Алгебраїчна сума векторів',
                        content: 'a(x1;y1) ; b(x2;y2)<br>c=a+b<br>c=(x1+x2;y1+y2)'
                    },
                    {
                        type: 'ol',
                        name: 'Є 2 правила додавання векторів',
                        data: [
                            {
                                type: 'p',
                                content: 'Правило трикутника: Переносимо другий вектор на початок першого і відрізок, що з`єднує початок першого і кінець другого вектора - це сума цих векторів'
                            },
                            {
                                type: 'p',
                                content: 'Правило паралелограма: Переносимо початок другого вектора до початку першого, домальовуємо паралелограм і діагональ, що виходить із початку обох векторів і є сумою двох векторів'
                            }
                        ]
                    }
                ]
            },
            {
                name: 'Віднімання векторів',
                elements: [
                    {
                        type: 'p',
                        content: 'Для того, щоб відняти два вектори, ми домножуємо другий вектор на -1 і додаємо їх'
                    }
                ]
            },
            {
                name: 'Множення вектора на число',
                elements: [
                    {
                        type: 'np',
                        name: 'Добутком вектора на число є вектор, координати якого є добутком відповідних координат даного вектора на дане число',
                        content: 'a(x;y)<br>ka(kx;ky)'
                    },
                    {
                        type: 'np',
                        name: 'Модуль вектора',
                        content: 'Модуль вектора ka=|k|*|a|'
                    },
                    {
                        type: 'ul',
                        name: 'Напрям ka',
                        data: [
                            {
                                type: 'p',
                                content: 'Збігається з напрямом a, якщо k > 0'
                            },
                            {
                                type: 'p',
                                content: 'Протилежний напряму a, якщо k < 0'
                            }
                        ]
                    },
                    {
                        type: 'np',
                        name: 'У колінеарних векторів відповідні координати пропорційні',
                        content: 'a(x1;y1); b(x2;y2)<br>x1x2=y1y2=k<br>k>0 a, b - однонапрямлені<br>k<0 a, b - протилежнонапрямлені'
                    }
                ]
            },
            {
                name: 'Скалярний добуток векторів',
                elements: [
                    {
                        type: 'p',
                        content: 'a(x1;y1); b(x2;y2)<br>a*b=x1x2+y1y2 '
                    }
                ]
            },
            {
                name: 'Кут між векторами',
                elements: [
                    {
                        type: 'p',
                        content: 'Кут між векторами - це кут, який утворюють вектори, три перенесенні їх так, щоб їх початки збігались'
                    },
                    {
                        type: 'p',
                        content: 'ab=|a|*|b|cosa, де a-кут між векторами'
                    },
                    {
                        type: 'p',
                        content: 'Якщо a перпендикулярний до b, то ab=0'
                    },
                    {
                        type: 'p',
                        content: 'а-тупий, то ab<0'
                    },
                    {
                        type: 'p',
                        content: 'а-гострий, то ab>0'
                    }
                ]
            }
        ],
        'Інше': [
            {
                name: 'Відстань між точками із заданими координатами',
                elements: [
                    {
                        type: 'p',
                        content: 'A(x1;y1) B(x2;y2)<br>AB=((x1-x2)^2+(y1-y2)^2)^(1/2)'
                    }
                ]
            },
            {
                name: 'Координата середини відрізка',
                elements: [
                    {
                        type: 'p',
                        content: 'A(x1;y1) B(x2;y2)<br>С(x0;y0) - середина AB<br>x0=(x1+x2)/2; y0=(y1+y2)/2'
                    }
                ]
            },
            {
                name: 'Рівняння кола',
                elements: [
                    {
                        type: 'p',
                        content: '(x-a)^2 +(y-b)^2 = R^2, де (a;b)-центр кола, R - радіус'
                    }
                ]
            },
            {
                name: 'Рівняння кола',
                elements: [
                    {
                        type: 'p',
                        name: 'Рівняння прямої має вигляд',
                        content: 'ax+by=c, де a,b,c-деякі числа, при чому a,b0 одночасно'
                    },
                    {
                        type: 'p',
                        content: 'Рівняння прямої не можна перетворити на kx+b, якщо b=0'
                    }
                ]
            },
            {
                name: 'Кутовий коефіцієнт прямої',
                elements: [
                    {
                        type: 'p',
                        content: 'y=kx+b, де k-кутовий коефіцієнт'
                    },
                    {
                        type: 'p',
                        content: 'k=tg(а); а-кут нахилу прямої з додатнім напрямом осі x'
                    },
                    {
                        type: 'p',
                        content: 'k>0-зростає; а-гострий'
                    },
                    {
                        type: 'p',
                        content: 'k<0-спадає; а-тупий'
                    },
                    {
                        type: 'p',
                        content: 'Якщо прямі паралельні, то в них однаковий кутовий коефіцієнт'
                    }
                ]
            },
            {
                name: 'Геометричні перетворення',
                elements: [
                    {
                        type: 'p',
                        content: 'Перетворення фігури F називають переміщенням(рухом), якщо воно зберігає відстань між точками'
                    },
                    {
                        type: 'p',
                        content: 'Паралельне перенесення - це перетворення, при якому точки зміщуються тому самому напрямі на ту саму відстань'
                    },
                    {
                        type: 'p',
                        content: 'В координатній площині при паралельному перенесенні т.M(x;y) з координати (x;y) переходить на вектор a в точку M1, таку, що x1=x+a, y1=y+b'
                    }
                ]
            },
            {
                name: 'Симетрія відносно прямої(осьова симетрія)',
                elements: [
                    {
                        type: 'p',
                        content: 'т.A і A1називають симетричними відносно прямої l, якщо пряма l - серединний перпендикуляр до відрізка AA1'
                    }
                ]
            },
            {
                name: 'Симетрія відносно точки(центральна симетрія)',
                elements: [
                    {
                        type: 'p',
                        content: 'т. A і A1 називають симетричними відносно т. O, якщо т. O є серединою AA1. т.O - центр симетрії'
                    }
                ]
            },
            {
                name: 'Поворот',
                elements: [
                    {
                        type: 'p',
                        content: 'Поворотом фігури F навколо т. O на кут а називається таке перетворення, при якому будь-яка т. A фігури F переходить в т. A1, яка є належить фігурі F1, таку, що AO=A1O і ∠AOA1=а'
                    },
                    {
                        type: 'p',
                        content: 'Поворот може здійснюватись за або проти годинникової стрілки'
                    },
                    {
                        type: 'p',
                        content: 'Поворот задається кутом, центром і напрямком повороту'
                    }
                ]
            },
            {
                name: 'Площі подібних фігур',
                elements: [
                    {
                        type: 'np',
                        name: 'Відношення подібних фігур дорівнює квадрату коефіцієнта подібності',
                        content: 'ABC~A1B1C1<br>AB/A1B1=BC/B1C1=AC/A1C1=k<br>S(ABC)/S(A1B1C1)=k^2'
                    },
                ]
            }
        ]
    }
}

export default pages